zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
/**
 * \brief Component description for PIC32CZ/CA70 MCAN
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_MCAN_COMPONENT_H_
#define _PIC32CZ_CA70_MCAN_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_MCAN Controller Area Network
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR MCAN */
/* ========================================================================== */

/* -------- MCAN_CREL : (MCAN Offset: 0x00) (R/ 32) Core Release Register -------- */

typedef union
{
  struct
  {
    uint32_t DAY:8;                     /**< bit:   0..7  Timestamp Day                                 */
    uint32_t MON:8;                     /**< bit:  8..15  Timestamp Month                               */
    uint32_t YEAR:4;                    /**< bit: 16..19  Timestamp Year                                */
    uint32_t SUBSTEP:4;                 /**< bit: 20..23  Sub-step of Core Release                      */
    uint32_t STEP:4;                    /**< bit: 24..27  Step of Core Release                          */
    uint32_t REL:4;                     /**< bit: 28..31  Core Release                                  */
  };
  uint32_t w;
} __MCAN_CREL_bits_t;

#define MCAN_CREL_DAY_Pos                     (0)                                            /**< (MCAN_CREL) Timestamp Day Position */
#define MCAN_CREL_DAY_Msk                     (0xFFU << MCAN_CREL_DAY_Pos)                   /**< (MCAN_CREL) Timestamp Day Mask */
#define MCAN_CREL_DAY(value)                  (MCAN_CREL_DAY_Msk & ((value) << MCAN_CREL_DAY_Pos))
#define MCAN_CREL_MON_Pos                     (8)                                            /**< (MCAN_CREL) Timestamp Month Position */
#define MCAN_CREL_MON_Msk                     (0xFFU << MCAN_CREL_MON_Pos)                   /**< (MCAN_CREL) Timestamp Month Mask */
#define MCAN_CREL_MON(value)                  (MCAN_CREL_MON_Msk & ((value) << MCAN_CREL_MON_Pos))
#define MCAN_CREL_YEAR_Pos                    (16)                                           /**< (MCAN_CREL) Timestamp Year Position */
#define MCAN_CREL_YEAR_Msk                    (0xFU << MCAN_CREL_YEAR_Pos)                   /**< (MCAN_CREL) Timestamp Year Mask */
#define MCAN_CREL_YEAR(value)                 (MCAN_CREL_YEAR_Msk & ((value) << MCAN_CREL_YEAR_Pos))
#define MCAN_CREL_SUBSTEP_Pos                 (20)                                           /**< (MCAN_CREL) Sub-step of Core Release Position */
#define MCAN_CREL_SUBSTEP_Msk                 (0xFU << MCAN_CREL_SUBSTEP_Pos)                /**< (MCAN_CREL) Sub-step of Core Release Mask */
#define MCAN_CREL_SUBSTEP(value)              (MCAN_CREL_SUBSTEP_Msk & ((value) << MCAN_CREL_SUBSTEP_Pos))
#define MCAN_CREL_STEP_Pos                    (24)                                           /**< (MCAN_CREL) Step of Core Release Position */
#define MCAN_CREL_STEP_Msk                    (0xFU << MCAN_CREL_STEP_Pos)                   /**< (MCAN_CREL) Step of Core Release Mask */
#define MCAN_CREL_STEP(value)                 (MCAN_CREL_STEP_Msk & ((value) << MCAN_CREL_STEP_Pos))
#define MCAN_CREL_REL_Pos                     (28)                                           /**< (MCAN_CREL) Core Release Position */
#define MCAN_CREL_REL_Msk                     (0xFU << MCAN_CREL_REL_Pos)                    /**< (MCAN_CREL) Core Release Mask */
#define MCAN_CREL_REL(value)                  (MCAN_CREL_REL_Msk & ((value) << MCAN_CREL_REL_Pos))
#define MCAN_CREL_Msk                         (0xFFFFFFFFUL)                                 /**< (MCAN_CREL) Register Mask  */

/* -------- MCAN_ENDN : (MCAN Offset: 0x04) (R/ 32) Endian Register -------- */

typedef union
{
  struct
  {
    uint32_t ETV:32;                    /**< bit:  0..31  Endianness Test Value                         */
  };
  uint32_t w;
} __MCAN_ENDN_bits_t;

#define MCAN_ENDN_ETV_Pos                     (0)                                            /**< (MCAN_ENDN) Endianness Test Value Position */
#define MCAN_ENDN_ETV_Msk                     (0xFFFFFFFFU << MCAN_ENDN_ETV_Pos)             /**< (MCAN_ENDN) Endianness Test Value Mask */
#define MCAN_ENDN_ETV(value)                  (MCAN_ENDN_ETV_Msk & ((value) << MCAN_ENDN_ETV_Pos))
#define MCAN_ENDN_Msk                         (0xFFFFFFFFUL)                                 /**< (MCAN_ENDN) Register Mask  */

/* -------- MCAN_CUST : (MCAN Offset: 0x08) (R/W 32) Customer Register -------- */

typedef union
{
  struct
  {
    uint32_t CSV:32;                    /**< bit:  0..31  Customer-specific Value                       */
  };
  uint32_t w;
} __MCAN_CUST_bits_t;

#define MCAN_CUST_CSV_Pos                     (0)                                            /**< (MCAN_CUST) Customer-specific Value Position */
#define MCAN_CUST_CSV_Msk                     (0xFFFFFFFFU << MCAN_CUST_CSV_Pos)             /**< (MCAN_CUST) Customer-specific Value Mask */
#define MCAN_CUST_CSV(value)                  (MCAN_CUST_CSV_Msk & ((value) << MCAN_CUST_CSV_Pos))
#define MCAN_CUST_Msk                         (0xFFFFFFFFUL)                                 /**< (MCAN_CUST) Register Mask  */

/* -------- MCAN_DBTP : (MCAN Offset: 0x0c) (R/W 32) Data Bit Timing and Prescaler Register -------- */

typedef union
{
  struct
  {
    uint32_t DSJW:3;                    /**< bit:   0..2  Data (Re) Synchronization Jump Width          */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t DTSEG2:4;                  /**< bit:   4..7  Data Time Segment After Sample Point          */
    uint32_t DTSEG1:5;                  /**< bit:  8..12  Data Time Segment Before Sample Point         */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t DBRP:5;                    /**< bit: 16..20  Data Bit Rate Prescaler                       */
    uint32_t :2;                        /**< bit: 21..22  Reserved                                      */
    uint32_t TDC:1;                     /**< bit:     23  Transmitter Delay Compensation                */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_DBTP_bits_t;

#define MCAN_DBTP_DSJW_Pos                    (0)                                            /**< (MCAN_DBTP) Data (Re) Synchronization Jump Width Position */
#define MCAN_DBTP_DSJW_Msk                    (0x7U << MCAN_DBTP_DSJW_Pos)                   /**< (MCAN_DBTP) Data (Re) Synchronization Jump Width Mask */
#define MCAN_DBTP_DSJW(value)                 (MCAN_DBTP_DSJW_Msk & ((value) << MCAN_DBTP_DSJW_Pos))
#define MCAN_DBTP_DTSEG2_Pos                  (4)                                            /**< (MCAN_DBTP) Data Time Segment After Sample Point Position */
#define MCAN_DBTP_DTSEG2_Msk                  (0xFU << MCAN_DBTP_DTSEG2_Pos)                 /**< (MCAN_DBTP) Data Time Segment After Sample Point Mask */
#define MCAN_DBTP_DTSEG2(value)               (MCAN_DBTP_DTSEG2_Msk & ((value) << MCAN_DBTP_DTSEG2_Pos))
#define MCAN_DBTP_DTSEG1_Pos                  (8)                                            /**< (MCAN_DBTP) Data Time Segment Before Sample Point Position */
#define MCAN_DBTP_DTSEG1_Msk                  (0x1FU << MCAN_DBTP_DTSEG1_Pos)                /**< (MCAN_DBTP) Data Time Segment Before Sample Point Mask */
#define MCAN_DBTP_DTSEG1(value)               (MCAN_DBTP_DTSEG1_Msk & ((value) << MCAN_DBTP_DTSEG1_Pos))
#define MCAN_DBTP_DBRP_Pos                    (16)                                           /**< (MCAN_DBTP) Data Bit Rate Prescaler Position */
#define MCAN_DBTP_DBRP_Msk                    (0x1FU << MCAN_DBTP_DBRP_Pos)                  /**< (MCAN_DBTP) Data Bit Rate Prescaler Mask */
#define MCAN_DBTP_DBRP(value)                 (MCAN_DBTP_DBRP_Msk & ((value) << MCAN_DBTP_DBRP_Pos))
#define MCAN_DBTP_TDC_Pos                     (23)                                           /**< (MCAN_DBTP) Transmitter Delay Compensation Position */
#define MCAN_DBTP_TDC_Msk                     (0x1U << MCAN_DBTP_TDC_Pos)                    /**< (MCAN_DBTP) Transmitter Delay Compensation Mask */
#define   MCAN_DBTP_TDC_DISABLED_Val          (0x0U)                                         /**< (MCAN_DBTP) Transmitter Delay Compensation disabled.  */
#define   MCAN_DBTP_TDC_ENABLED_Val           (0x1U)                                         /**< (MCAN_DBTP) Transmitter Delay Compensation enabled.  */
#define MCAN_DBTP_TDC_DISABLED                (MCAN_DBTP_TDC_DISABLED_Val << MCAN_DBTP_TDC_Pos)  /**< (MCAN_DBTP) Transmitter Delay Compensation disabled. Position  */
#define MCAN_DBTP_TDC_ENABLED                 (MCAN_DBTP_TDC_ENABLED_Val << MCAN_DBTP_TDC_Pos)  /**< (MCAN_DBTP) Transmitter Delay Compensation enabled. Position  */
#define MCAN_DBTP_Msk                         (0x009F1FF7UL)                                 /**< (MCAN_DBTP) Register Mask  */

