zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
/* -------- MCAN_TEST : (MCAN Offset: 0x10) (R/W 32) Test Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t LBCK:1;                    /**< bit:      4  Loop Back Mode (read/write)                   */
    uint32_t TX:2;                      /**< bit:   5..6  Control of Transmit Pin (read/write)          */
    uint32_t RX:1;                      /**< bit:      7  Receive Pin (read-only)                       */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_TEST_bits_t;

#define MCAN_TEST_LBCK_Pos                    (4)                                            /**< (MCAN_TEST) Loop Back Mode (read/write) Position */
#define MCAN_TEST_LBCK_Msk                    (0x1U << MCAN_TEST_LBCK_Pos)                   /**< (MCAN_TEST) Loop Back Mode (read/write) Mask */
#define   MCAN_TEST_LBCK_DISABLED_Val         (0x0U)                                         /**< (MCAN_TEST) Reset value. Loop Back mode is disabled.  */
#define   MCAN_TEST_LBCK_ENABLED_Val          (0x1U)                                         /**< (MCAN_TEST) Loop Back mode is enabled (see Section 6.1.9).  */
#define MCAN_TEST_LBCK_DISABLED               (MCAN_TEST_LBCK_DISABLED_Val << MCAN_TEST_LBCK_Pos)  /**< (MCAN_TEST) Reset value. Loop Back mode is disabled. Position  */
#define MCAN_TEST_LBCK_ENABLED                (MCAN_TEST_LBCK_ENABLED_Val << MCAN_TEST_LBCK_Pos)  /**< (MCAN_TEST) Loop Back mode is enabled (see Section 6.1.9). Position  */
#define MCAN_TEST_TX_Pos                      (5)                                            /**< (MCAN_TEST) Control of Transmit Pin (read/write) Position */
#define MCAN_TEST_TX_Msk                      (0x3U << MCAN_TEST_TX_Pos)                     /**< (MCAN_TEST) Control of Transmit Pin (read/write) Mask */
#define MCAN_TEST_TX(value)                   (MCAN_TEST_TX_Msk & ((value) << MCAN_TEST_TX_Pos))
#define   MCAN_TEST_TX_RESET_Val              (0x0U)                                         /**< (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time.  */
#define   MCAN_TEST_TX_SAMPLE_POINT_MONITORING_Val (0x1U)                                         /**< (MCAN_TEST) Sample Point can be monitored at pin CANTX.  */
#define   MCAN_TEST_TX_DOMINANT_Val           (0x2U)                                         /**< (MCAN_TEST) Dominant ('0') level at pin CANTX.  */
#define   MCAN_TEST_TX_RECESSIVE_Val          (0x3U)                                         /**< (MCAN_TEST) Recessive ('1') at pin CANTX.  */
#define MCAN_TEST_TX_RESET                    (MCAN_TEST_TX_RESET_Val << MCAN_TEST_TX_Pos)   /**< (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time. Position  */
#define MCAN_TEST_TX_SAMPLE_POINT_MONITORING  (MCAN_TEST_TX_SAMPLE_POINT_MONITORING_Val << MCAN_TEST_TX_Pos)  /**< (MCAN_TEST) Sample Point can be monitored at pin CANTX. Position  */
#define MCAN_TEST_TX_DOMINANT                 (MCAN_TEST_TX_DOMINANT_Val << MCAN_TEST_TX_Pos)  /**< (MCAN_TEST) Dominant ('0') level at pin CANTX. Position  */
#define MCAN_TEST_TX_RECESSIVE                (MCAN_TEST_TX_RECESSIVE_Val << MCAN_TEST_TX_Pos)  /**< (MCAN_TEST) Recessive ('1') at pin CANTX. Position  */
#define MCAN_TEST_RX_Pos                      (7)                                            /**< (MCAN_TEST) Receive Pin (read-only) Position */
#define MCAN_TEST_RX_Msk                      (0x1U << MCAN_TEST_RX_Pos)                     /**< (MCAN_TEST) Receive Pin (read-only) Mask */
#define MCAN_TEST_Msk                         (0x000000F0UL)                                 /**< (MCAN_TEST) Register Mask  */

/* -------- MCAN_RWD : (MCAN Offset: 0x14) (R/W 32) RAM Watchdog Register -------- */

typedef union
{
  struct
  {
    uint32_t WDC:8;                     /**< bit:   0..7  Watchdog Configuration (read/write)           */
    uint32_t WDV:8;                     /**< bit:  8..15  Watchdog Value (read-only)                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_RWD_bits_t;

#define MCAN_RWD_WDC_Pos                      (0)                                            /**< (MCAN_RWD) Watchdog Configuration (read/write) Position */
#define MCAN_RWD_WDC_Msk                      (0xFFU << MCAN_RWD_WDC_Pos)                    /**< (MCAN_RWD) Watchdog Configuration (read/write) Mask */
#define MCAN_RWD_WDC(value)                   (MCAN_RWD_WDC_Msk & ((value) << MCAN_RWD_WDC_Pos))
#define MCAN_RWD_WDV_Pos                      (8)                                            /**< (MCAN_RWD) Watchdog Value (read-only) Position */
#define MCAN_RWD_WDV_Msk                      (0xFFU << MCAN_RWD_WDV_Pos)                    /**< (MCAN_RWD) Watchdog Value (read-only) Mask */
#define MCAN_RWD_WDV(value)                   (MCAN_RWD_WDV_Msk & ((value) << MCAN_RWD_WDV_Pos))
#define MCAN_RWD_Msk                          (0x0000FFFFUL)                                 /**< (MCAN_RWD) Register Mask  */

/* -------- MCAN_CCCR : (MCAN Offset: 0x18) (R/W 32) CC Control Register -------- */

typedef union
{
  struct
  {
    uint32_t INIT:1;                    /**< bit:      0  Initialization (read/write)                   */
    uint32_t CCE:1;                     /**< bit:      1  Configuration Change Enable (read/write, write protection) */
    uint32_t ASM:1;                     /**< bit:      2  Restricted Operation Mode (read/write, write protection against '1') */
    uint32_t CSA:1;                     /**< bit:      3  Clock Stop Acknowledge (read-only)            */
    uint32_t CSR:1;                     /**< bit:      4  Clock Stop Request (read/write)               */
    uint32_t MON:1;                     /**< bit:      5  Bus Monitoring Mode (read/write, write protection against '1') */
    uint32_t DAR:1;                     /**< bit:      6  Disable Automatic Retransmission (read/write, write protection) */
    uint32_t TEST:1;                    /**< bit:      7  Test Mode Enable (read/write, write protection against '1') */
    uint32_t FDOE:1;                    /**< bit:      8  CAN FD Operation Enable (read/write, write protection) */
    uint32_t BRSE:1;                    /**< bit:      9  Bit Rate Switching Enable (read/write, write protection) */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t PXHD:1;                    /**< bit:     12  Protocol Exception Event Handling (read/write, write protection) */
    uint32_t EFBI:1;                    /**< bit:     13  Edge Filtering during Bus Integration (read/write, write protection) */
    uint32_t TXP:1;                     /**< bit:     14  Transmit Pause (read/write, write protection) */
    uint32_t NISO:1;                    /**< bit:     15  Non-ISO Operation                             */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_CCCR_bits_t;

