zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
/* -------- MCAN_TDCR : (MCAN Offset: 0x48) (R/W 32) Transmit Delay Compensation Register -------- */

typedef union
{
  struct
  {
    uint32_t TDCF:7;                    /**< bit:   0..6  Transmitter Delay Compensation Filter         */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t TDCO:7;                    /**< bit:  8..14  Transmitter Delay Compensation Offset         */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_TDCR_bits_t;

#define MCAN_TDCR_TDCF_Pos                    (0)                                            /**< (MCAN_TDCR) Transmitter Delay Compensation Filter Position */
#define MCAN_TDCR_TDCF_Msk                    (0x7FU << MCAN_TDCR_TDCF_Pos)                  /**< (MCAN_TDCR) Transmitter Delay Compensation Filter Mask */
#define MCAN_TDCR_TDCF(value)                 (MCAN_TDCR_TDCF_Msk & ((value) << MCAN_TDCR_TDCF_Pos))
#define MCAN_TDCR_TDCO_Pos                    (8)                                            /**< (MCAN_TDCR) Transmitter Delay Compensation Offset Position */
#define MCAN_TDCR_TDCO_Msk                    (0x7FU << MCAN_TDCR_TDCO_Pos)                  /**< (MCAN_TDCR) Transmitter Delay Compensation Offset Mask */
#define MCAN_TDCR_TDCO(value)                 (MCAN_TDCR_TDCO_Msk & ((value) << MCAN_TDCR_TDCO_Pos))
#define MCAN_TDCR_Msk                         (0x00007F7FUL)                                 /**< (MCAN_TDCR) Register Mask  */

/* -------- MCAN_IR : (MCAN Offset: 0x50) (R/W 32) Interrupt Register -------- */

typedef union
{
  struct
  {
    uint32_t RF0N:1;                    /**< bit:      0  Receive FIFO 0 New Message                    */
    uint32_t RF0W:1;                    /**< bit:      1  Receive FIFO 0 Watermark Reached              */
    uint32_t RF0F:1;                    /**< bit:      2  Receive FIFO 0 Full                           */
    uint32_t RF0L:1;                    /**< bit:      3  Receive FIFO 0 Message Lost                   */
    uint32_t RF1N:1;                    /**< bit:      4  Receive FIFO 1 New Message                    */
    uint32_t RF1W:1;                    /**< bit:      5  Receive FIFO 1 Watermark Reached              */
    uint32_t RF1F:1;                    /**< bit:      6  Receive FIFO 1 Full                           */
    uint32_t RF1L:1;                    /**< bit:      7  Receive FIFO 1 Message Lost                   */
    uint32_t HPM:1;                     /**< bit:      8  High Priority Message                         */
    uint32_t TC:1;                      /**< bit:      9  Transmission Completed                        */
    uint32_t TCF:1;                     /**< bit:     10  Transmission Cancellation Finished            */
    uint32_t TFE:1;                     /**< bit:     11  Tx FIFO Empty                                 */
    uint32_t TEFN:1;                    /**< bit:     12  Tx Event FIFO New Entry                       */
    uint32_t TEFW:1;                    /**< bit:     13  Tx Event FIFO Watermark Reached               */
    uint32_t TEFF:1;                    /**< bit:     14  Tx Event FIFO Full                            */
    uint32_t TEFL:1;                    /**< bit:     15  Tx Event FIFO Element Lost                    */
    uint32_t TSW:1;                     /**< bit:     16  Timestamp Wraparound                          */
    uint32_t MRAF:1;                    /**< bit:     17  Message RAM Access Failure                    */
    uint32_t TOO:1;                     /**< bit:     18  Timeout Occurred                              */
    uint32_t DRX:1;                     /**< bit:     19  Message stored to Dedicated Receive Buffer    */
    uint32_t BEC:1;                     /**< bit:     20  Bit Error Corrected                           */
    uint32_t BEU:1;                     /**< bit:     21  Bit Error Uncorrected                         */
    uint32_t ELO:1;                     /**< bit:     22  Error Logging Overflow                        */
    uint32_t EP:1;                      /**< bit:     23  Error Passive                                 */
    uint32_t EW:1;                      /**< bit:     24  Warning Status                                */
    uint32_t BO:1;                      /**< bit:     25  Bus_Off Status                                */
    uint32_t WDI:1;                     /**< bit:     26  Watchdog Interrupt                            */
    uint32_t PEA:1;                     /**< bit:     27  Protocol Error in Arbitration Phase           */
    uint32_t PED:1;                     /**< bit:     28  Protocol Error in Data Phase                  */
    uint32_t ARA:1;                     /**< bit:     29  Access to Reserved Address                    */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_IR_bits_t;

#define MCAN_IR_RF0N_Pos                      (0)                                            /**< (MCAN_IR) Receive FIFO 0 New Message Position */
#define MCAN_IR_RF0N_Msk                      (0x1U << MCAN_IR_RF0N_Pos)                     /**< (MCAN_IR) Receive FIFO 0 New Message Mask */
#define MCAN_IR_RF0W_Pos                      (1)                                            /**< (MCAN_IR) Receive FIFO 0 Watermark Reached Position */
#define MCAN_IR_RF0W_Msk                      (0x1U << MCAN_IR_RF0W_Pos)                     /**< (MCAN_IR) Receive FIFO 0 Watermark Reached Mask */
#define MCAN_IR_RF0F_Pos                      (2)                                            /**< (MCAN_IR) Receive FIFO 0 Full Position */
#define MCAN_IR_RF0F_Msk                      (0x1U << MCAN_IR_RF0F_Pos)                     /**< (MCAN_IR) Receive FIFO 0 Full Mask */
#define MCAN_IR_RF0L_Pos                      (3)                                            /**< (MCAN_IR) Receive FIFO 0 Message Lost Position */
#define MCAN_IR_RF0L_Msk                      (0x1U << MCAN_IR_RF0L_Pos)                     /**< (MCAN_IR) Receive FIFO 0 Message Lost Mask */
#define MCAN_IR_RF1N_Pos                      (4)                                            /**< (MCAN_IR) Receive FIFO 1 New Message Position */
#define MCAN_IR_RF1N_Msk                      (0x1U << MCAN_IR_RF1N_Pos)                     /**< (MCAN_IR) Receive FIFO 1 New Message Mask */
#define MCAN_IR_RF1W_Pos                      (5)                                            /**< (MCAN_IR) Receive FIFO 1 Watermark Reached Position */
#define MCAN_IR_RF1W_Msk                      (0x1U << MCAN_IR_RF1W_Pos)                     /**< (MCAN_IR) Receive FIFO 1 Watermark Reached Mask */
#define MCAN_IR_RF1F_Pos                      (6)                                            /**< (MCAN_IR) Receive FIFO 1 Full Position */
#define MCAN_IR_RF1F_Msk                      (0x1U << MCAN_IR_RF1F_Pos)                     /**< (MCAN_IR) Receive FIFO 1 Full Mask */
#define MCAN_IR_RF1L_Pos                      (7)                                            /**< (MCAN_IR) Receive FIFO 1 Message Lost Position */
#define MCAN_IR_RF1L_Msk                      (0x1U << MCAN_IR_RF1L_Pos)                     /**< (MCAN_IR) Receive FIFO 1 Message Lost Mask */
#define MCAN_IR_HPM_Pos                       (8)                                            /**< (MCAN_IR) High Priority Message Position */
#define MCAN_IR_HPM_Msk                       (0x1U << MCAN_IR_HPM_Pos)                      /**< (MCAN_IR) High Priority Message Mask */
#define MCAN_IR_TC_Pos                        (9)                                            /**< (MCAN_IR) Transmission Completed Position */
#define MCAN_IR_TC_Msk                        (0x1U << MCAN_IR_TC_Pos)                       /**< (MCAN_IR) Transmission Completed Mask */
#define MCAN_IR_TCF_Pos                       (10)                                           /**< (MCAN_IR) Transmission Cancellation Finished Position */
#define MCAN_IR_TCF_Msk                       (0x1U << MCAN_IR_TCF_Pos)                      /**< (MCAN_IR) Transmission Cancellation Finished Mask */
#define MCAN_IR_TFE_Pos                       (11)                                           /**< (MCAN_IR) Tx FIFO Empty Position */
#define MCAN_IR_TFE_Msk                       (0x1U << MCAN_IR_TFE_Pos)                      /**< (MCAN_IR) Tx FIFO Empty Mask */
#define MCAN_IR_TEFN_Pos                      (12)                                           /**< (MCAN_IR) Tx Event FIFO New Entry Position */
#define MCAN_IR_TEFN_Msk                      (0x1U << MCAN_IR_TEFN_Pos)                     /**< (MCAN_IR) Tx Event FIFO New Entry Mask */
#define MCAN_IR_TEFW_Pos                      (13)                                           /**< (MCAN_IR) Tx Event FIFO Watermark Reached Position */
#define MCAN_IR_TEFW_Msk                      (0x1U << MCAN_IR_TEFW_Pos)                     /**< (MCAN_IR) Tx Event FIFO Watermark Reached Mask */
#define MCAN_IR_TEFF_Pos                      (14)                                           /**< (MCAN_IR) Tx Event FIFO Full Position */
#define MCAN_IR_TEFF_Msk                      (0x1U << MCAN_IR_TEFF_Pos)                     /**< (MCAN_IR) Tx Event FIFO Full Mask */
#define MCAN_IR_TEFL_Pos                      (15)                                           /**< (MCAN_IR) Tx Event FIFO Element Lost Position */
#define MCAN_IR_TEFL_Msk                      (0x1U << MCAN_IR_TEFL_Pos)                     /**< (MCAN_IR) Tx Event FIFO Element Lost Mask */
#define MCAN_IR_TSW_Pos                       (16)                                           /**< (MCAN_IR) Timestamp Wraparound Position */
#define MCAN_IR_TSW_Msk                       (0x1U << MCAN_IR_TSW_Pos)                      /**< (MCAN_IR) Timestamp Wraparound Mask */
#define MCAN_IR_MRAF_Pos                      (17)                                           /**< (MCAN_IR) Message RAM Access Failure Position */
#define MCAN_IR_MRAF_Msk                      (0x1U << MCAN_IR_MRAF_Pos)                     /**< (MCAN_IR) Message RAM Access Failure Mask */
#define MCAN_IR_TOO_Pos                       (18)                                           /**< (MCAN_IR) Timeout Occurred Position */
#define MCAN_IR_TOO_Msk                       (0x1U << MCAN_IR_TOO_Pos)                      /**< (MCAN_IR) Timeout Occurred Mask */
#define MCAN_IR_DRX_Pos                       (19)                                           /**< (MCAN_IR) Message stored to Dedicated Receive Buffer Position */
#define MCAN_IR_DRX_Msk                       (0x1U << MCAN_IR_DRX_Pos)                      /**< (MCAN_IR) Message stored to Dedicated Receive Buffer Mask */
#define MCAN_IR_BEC_Pos                       (20)                                           /**< (MCAN_IR) Bit Error Corrected Position */
#define MCAN_IR_BEC_Msk                       (0x1U << MCAN_IR_BEC_Pos)                      /**< (MCAN_IR) Bit Error Corrected Mask */
#define MCAN_IR_BEU_Pos                       (21)                                           /**< (MCAN_IR) Bit Error Uncorrected Position */
#define MCAN_IR_BEU_Msk                       (0x1U << MCAN_IR_BEU_Pos)                      /**< (MCAN_IR) Bit Error Uncorrected Mask */
#define MCAN_IR_ELO_Pos                       (22)                                           /**< (MCAN_IR) Error Logging Overflow Position */
#define MCAN_IR_ELO_Msk                       (0x1U << MCAN_IR_ELO_Pos)                      /**< (MCAN_IR) Error Logging Overflow Mask */
#define MCAN_IR_EP_Pos                        (23)                                           /**< (MCAN_IR) Error Passive Position */
#define MCAN_IR_EP_Msk                        (0x1U << MCAN_IR_EP_Pos)                       /**< (MCAN_IR) Error Passive Mask */
#define MCAN_IR_EW_Pos                        (24)                                           /**< (MCAN_IR) Warning Status Position */
#define MCAN_IR_EW_Msk                        (0x1U << MCAN_IR_EW_Pos)                       /**< (MCAN_IR) Warning Status Mask */
#define MCAN_IR_BO_Pos                        (25)                                           /**< (MCAN_IR) Bus_Off Status Position */
#define MCAN_IR_BO_Msk                        (0x1U << MCAN_IR_BO_Pos)                       /**< (MCAN_IR) Bus_Off Status Mask */
#define MCAN_IR_WDI_Pos                       (26)                                           /**< (MCAN_IR) Watchdog Interrupt Position */
#define MCAN_IR_WDI_Msk                       (0x1U << MCAN_IR_WDI_Pos)                      /**< (MCAN_IR) Watchdog Interrupt Mask */
#define MCAN_IR_PEA_Pos                       (27)                                           /**< (MCAN_IR) Protocol Error in Arbitration Phase Position */
#define MCAN_IR_PEA_Msk                       (0x1U << MCAN_IR_PEA_Pos)                      /**< (MCAN_IR) Protocol Error in Arbitration Phase Mask */
#define MCAN_IR_PED_Pos                       (28)                                           /**< (MCAN_IR) Protocol Error in Data Phase Position */
#define MCAN_IR_PED_Msk                       (0x1U << MCAN_IR_PED_Pos)                      /**< (MCAN_IR) Protocol Error in Data Phase Mask */
#define MCAN_IR_ARA_Pos                       (29)                                           /**< (MCAN_IR) Access to Reserved Address Position */
#define MCAN_IR_ARA_Msk                       (0x1U << MCAN_IR_ARA_Pos)                      /**< (MCAN_IR) Access to Reserved Address Mask */
#define MCAN_IR_Msk                           (0x3FFFFFFFUL)                                 /**< (MCAN_IR) Register Mask  */

/* -------- MCAN_IE : (MCAN Offset: 0x54) (R/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RF0NE:1;                   /**< bit:      0  Receive FIFO 0 New Message Interrupt Enable   */
    uint32_t RF0WE:1;                   /**< bit:      1  Receive FIFO 0 Watermark Reached Interrupt Enable */
    uint32_t RF0FE:1;                   /**< bit:      2  Receive FIFO 0 Full Interrupt Enable          */
    uint32_t RF0LE:1;                   /**< bit:      3  Receive FIFO 0 Message Lost Interrupt Enable  */
    uint32_t RF1NE:1;                   /**< bit:      4  Receive FIFO 1 New Message Interrupt Enable   */
    uint32_t RF1WE:1;                   /**< bit:      5  Receive FIFO 1 Watermark Reached Interrupt Enable */
    uint32_t RF1FE:1;                   /**< bit:      6  Receive FIFO 1 Full Interrupt Enable          */
    uint32_t RF1LE:1;                   /**< bit:      7  Receive FIFO 1 Message Lost Interrupt Enable  */
    uint32_t HPME:1;                    /**< bit:      8  High Priority Message Interrupt Enable        */
    uint32_t TCE:1;                     /**< bit:      9  Transmission Completed Interrupt Enable       */
    uint32_t TCFE:1;                    /**< bit:     10  Transmission Cancellation Finished Interrupt Enable */
    uint32_t TFEE:1;                    /**< bit:     11  Tx FIFO Empty Interrupt Enable                */
    uint32_t TEFNE:1;                   /**< bit:     12  Tx Event FIFO New Entry Interrupt Enable      */
    uint32_t TEFWE:1;                   /**< bit:     13  Tx Event FIFO Watermark Reached Interrupt Enable */
    uint32_t TEFFE:1;                   /**< bit:     14  Tx Event FIFO Full Interrupt Enable           */
    uint32_t TEFLE:1;                   /**< bit:     15  Tx Event FIFO Event Lost Interrupt Enable     */
    uint32_t TSWE:1;                    /**< bit:     16  Timestamp Wraparound Interrupt Enable         */
    uint32_t MRAFE:1;                   /**< bit:     17  Message RAM Access Failure Interrupt Enable   */
    uint32_t TOOE:1;                    /**< bit:     18  Timeout Occurred Interrupt Enable             */
    uint32_t DRXE:1;                    /**< bit:     19  Message stored to Dedicated Receive Buffer Interrupt Enable */
    uint32_t BECE:1;                    /**< bit:     20  Bit Error Corrected Interrupt Enable          */
    uint32_t BEUE:1;                    /**< bit:     21  Bit Error Uncorrected Interrupt Enable        */
    uint32_t ELOE:1;                    /**< bit:     22  Error Logging Overflow Interrupt Enable       */
    uint32_t EPE:1;                     /**< bit:     23  Error Passive Interrupt Enable                */
    uint32_t EWE:1;                     /**< bit:     24  Warning Status Interrupt Enable               */
    uint32_t BOE:1;                     /**< bit:     25  Bus_Off Status Interrupt Enable               */
    uint32_t WDIE:1;                    /**< bit:     26  Watchdog Interrupt Enable                     */
    uint32_t PEAE:1;                    /**< bit:     27  Protocol Error in Arbitration Phase Enable    */
    uint32_t PEDE:1;                    /**< bit:     28  Protocol Error in Data Phase Enable           */
    uint32_t ARAE:1;                    /**< bit:     29  Access to Reserved Address Enable             */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_IE_bits_t;

