zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
#define MCAN_ILS_RF0NL_Pos                    (0)                                            /**< (MCAN_ILS) Receive FIFO 0 New Message Interrupt Line Position */
#define MCAN_ILS_RF0NL_Msk                    (0x1U << MCAN_ILS_RF0NL_Pos)                   /**< (MCAN_ILS) Receive FIFO 0 New Message Interrupt Line Mask */
#define MCAN_ILS_RF0WL_Pos                    (1)                                            /**< (MCAN_ILS) Receive FIFO 0 Watermark Reached Interrupt Line Position */
#define MCAN_ILS_RF0WL_Msk                    (0x1U << MCAN_ILS_RF0WL_Pos)                   /**< (MCAN_ILS) Receive FIFO 0 Watermark Reached Interrupt Line Mask */
#define MCAN_ILS_RF0FL_Pos                    (2)                                            /**< (MCAN_ILS) Receive FIFO 0 Full Interrupt Line Position */
#define MCAN_ILS_RF0FL_Msk                    (0x1U << MCAN_ILS_RF0FL_Pos)                   /**< (MCAN_ILS) Receive FIFO 0 Full Interrupt Line Mask */
#define MCAN_ILS_RF0LL_Pos                    (3)                                            /**< (MCAN_ILS) Receive FIFO 0 Message Lost Interrupt Line Position */
#define MCAN_ILS_RF0LL_Msk                    (0x1U << MCAN_ILS_RF0LL_Pos)                   /**< (MCAN_ILS) Receive FIFO 0 Message Lost Interrupt Line Mask */
#define MCAN_ILS_RF1NL_Pos                    (4)                                            /**< (MCAN_ILS) Receive FIFO 1 New Message Interrupt Line Position */
#define MCAN_ILS_RF1NL_Msk                    (0x1U << MCAN_ILS_RF1NL_Pos)                   /**< (MCAN_ILS) Receive FIFO 1 New Message Interrupt Line Mask */
#define MCAN_ILS_RF1WL_Pos                    (5)                                            /**< (MCAN_ILS) Receive FIFO 1 Watermark Reached Interrupt Line Position */
#define MCAN_ILS_RF1WL_Msk                    (0x1U << MCAN_ILS_RF1WL_Pos)                   /**< (MCAN_ILS) Receive FIFO 1 Watermark Reached Interrupt Line Mask */
#define MCAN_ILS_RF1FL_Pos                    (6)                                            /**< (MCAN_ILS) Receive FIFO 1 Full Interrupt Line Position */
#define MCAN_ILS_RF1FL_Msk                    (0x1U << MCAN_ILS_RF1FL_Pos)                   /**< (MCAN_ILS) Receive FIFO 1 Full Interrupt Line Mask */
#define MCAN_ILS_RF1LL_Pos                    (7)                                            /**< (MCAN_ILS) Receive FIFO 1 Message Lost Interrupt Line Position */
#define MCAN_ILS_RF1LL_Msk                    (0x1U << MCAN_ILS_RF1LL_Pos)                   /**< (MCAN_ILS) Receive FIFO 1 Message Lost Interrupt Line Mask */
#define MCAN_ILS_HPML_Pos                     (8)                                            /**< (MCAN_ILS) High Priority Message Interrupt Line Position */
#define MCAN_ILS_HPML_Msk                     (0x1U << MCAN_ILS_HPML_Pos)                    /**< (MCAN_ILS) High Priority Message Interrupt Line Mask */
#define MCAN_ILS_TCL_Pos                      (9)                                            /**< (MCAN_ILS) Transmission Completed Interrupt Line Position */
#define MCAN_ILS_TCL_Msk                      (0x1U << MCAN_ILS_TCL_Pos)                     /**< (MCAN_ILS) Transmission Completed Interrupt Line Mask */
#define MCAN_ILS_TCFL_Pos                     (10)                                           /**< (MCAN_ILS) Transmission Cancellation Finished Interrupt Line Position */
#define MCAN_ILS_TCFL_Msk                     (0x1U << MCAN_ILS_TCFL_Pos)                    /**< (MCAN_ILS) Transmission Cancellation Finished Interrupt Line Mask */
#define MCAN_ILS_TFEL_Pos                     (11)                                           /**< (MCAN_ILS) Tx FIFO Empty Interrupt Line Position */
#define MCAN_ILS_TFEL_Msk                     (0x1U << MCAN_ILS_TFEL_Pos)                    /**< (MCAN_ILS) Tx FIFO Empty Interrupt Line Mask */
#define MCAN_ILS_TEFNL_Pos                    (12)                                           /**< (MCAN_ILS) Tx Event FIFO New Entry Interrupt Line Position */
#define MCAN_ILS_TEFNL_Msk                    (0x1U << MCAN_ILS_TEFNL_Pos)                   /**< (MCAN_ILS) Tx Event FIFO New Entry Interrupt Line Mask */
#define MCAN_ILS_TEFWL_Pos                    (13)                                           /**< (MCAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line Position */
#define MCAN_ILS_TEFWL_Msk                    (0x1U << MCAN_ILS_TEFWL_Pos)                   /**< (MCAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line Mask */
#define MCAN_ILS_TEFFL_Pos                    (14)                                           /**< (MCAN_ILS) Tx Event FIFO Full Interrupt Line Position */
#define MCAN_ILS_TEFFL_Msk                    (0x1U << MCAN_ILS_TEFFL_Pos)                   /**< (MCAN_ILS) Tx Event FIFO Full Interrupt Line Mask */
#define MCAN_ILS_TEFLL_Pos                    (15)                                           /**< (MCAN_ILS) Tx Event FIFO Event Lost Interrupt Line Position */
#define MCAN_ILS_TEFLL_Msk                    (0x1U << MCAN_ILS_TEFLL_Pos)                   /**< (MCAN_ILS) Tx Event FIFO Event Lost Interrupt Line Mask */
#define MCAN_ILS_TSWL_Pos                     (16)                                           /**< (MCAN_ILS) Timestamp Wraparound Interrupt Line Position */
#define MCAN_ILS_TSWL_Msk                     (0x1U << MCAN_ILS_TSWL_Pos)                    /**< (MCAN_ILS) Timestamp Wraparound Interrupt Line Mask */
#define MCAN_ILS_MRAFL_Pos                    (17)                                           /**< (MCAN_ILS) Message RAM Access Failure Interrupt Line Position */
#define MCAN_ILS_MRAFL_Msk                    (0x1U << MCAN_ILS_MRAFL_Pos)                   /**< (MCAN_ILS) Message RAM Access Failure Interrupt Line Mask */
#define MCAN_ILS_TOOL_Pos                     (18)                                           /**< (MCAN_ILS) Timeout Occurred Interrupt Line Position */
#define MCAN_ILS_TOOL_Msk                     (0x1U << MCAN_ILS_TOOL_Pos)                    /**< (MCAN_ILS) Timeout Occurred Interrupt Line Mask */
#define MCAN_ILS_DRXL_Pos                     (19)                                           /**< (MCAN_ILS) Message stored to Dedicated Receive Buffer Interrupt Line Position */
#define MCAN_ILS_DRXL_Msk                     (0x1U << MCAN_ILS_DRXL_Pos)                    /**< (MCAN_ILS) Message stored to Dedicated Receive Buffer Interrupt Line Mask */
#define MCAN_ILS_BECL_Pos                     (20)                                           /**< (MCAN_ILS) Bit Error Corrected Interrupt Line Position */
#define MCAN_ILS_BECL_Msk                     (0x1U << MCAN_ILS_BECL_Pos)                    /**< (MCAN_ILS) Bit Error Corrected Interrupt Line Mask */
#define MCAN_ILS_BEUL_Pos                     (21)                                           /**< (MCAN_ILS) Bit Error Uncorrected Interrupt Line Position */
#define MCAN_ILS_BEUL_Msk                     (0x1U << MCAN_ILS_BEUL_Pos)                    /**< (MCAN_ILS) Bit Error Uncorrected Interrupt Line Mask */
#define MCAN_ILS_ELOL_Pos                     (22)                                           /**< (MCAN_ILS) Error Logging Overflow Interrupt Line Position */
#define MCAN_ILS_ELOL_Msk                     (0x1U << MCAN_ILS_ELOL_Pos)                    /**< (MCAN_ILS) Error Logging Overflow Interrupt Line Mask */
#define MCAN_ILS_EPL_Pos                      (23)                                           /**< (MCAN_ILS) Error Passive Interrupt Line Position */
#define MCAN_ILS_EPL_Msk                      (0x1U << MCAN_ILS_EPL_Pos)                     /**< (MCAN_ILS) Error Passive Interrupt Line Mask */
#define MCAN_ILS_EWL_Pos                      (24)                                           /**< (MCAN_ILS) Warning Status Interrupt Line Position */
#define MCAN_ILS_EWL_Msk                      (0x1U << MCAN_ILS_EWL_Pos)                     /**< (MCAN_ILS) Warning Status Interrupt Line Mask */
#define MCAN_ILS_BOL_Pos                      (25)                                           /**< (MCAN_ILS) Bus_Off Status Interrupt Line Position */
#define MCAN_ILS_BOL_Msk                      (0x1U << MCAN_ILS_BOL_Pos)                     /**< (MCAN_ILS) Bus_Off Status Interrupt Line Mask */
#define MCAN_ILS_WDIL_Pos                     (26)                                           /**< (MCAN_ILS) Watchdog Interrupt Line Position */
#define MCAN_ILS_WDIL_Msk                     (0x1U << MCAN_ILS_WDIL_Pos)                    /**< (MCAN_ILS) Watchdog Interrupt Line Mask */
#define MCAN_ILS_PEAL_Pos                     (27)                                           /**< (MCAN_ILS) Protocol Error in Arbitration Phase Line Position */
#define MCAN_ILS_PEAL_Msk                     (0x1U << MCAN_ILS_PEAL_Pos)                    /**< (MCAN_ILS) Protocol Error in Arbitration Phase Line Mask */
#define MCAN_ILS_PEDL_Pos                     (28)                                           /**< (MCAN_ILS) Protocol Error in Data Phase Line Position */
#define MCAN_ILS_PEDL_Msk                     (0x1U << MCAN_ILS_PEDL_Pos)                    /**< (MCAN_ILS) Protocol Error in Data Phase Line Mask */
#define MCAN_ILS_ARAL_Pos                     (29)                                           /**< (MCAN_ILS) Access to Reserved Address Line Position */
#define MCAN_ILS_ARAL_Msk                     (0x1U << MCAN_ILS_ARAL_Pos)                    /**< (MCAN_ILS) Access to Reserved Address Line Mask */
#define MCAN_ILS_Msk                          (0x3FFFFFFFUL)                                 /**< (MCAN_ILS) Register Mask  */

/* -------- MCAN_ILE : (MCAN Offset: 0x5c) (R/W 32) Interrupt Line Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t EINT0:1;                   /**< bit:      0  Enable Interrupt Line 0                       */
    uint32_t EINT1:1;                   /**< bit:      1  Enable Interrupt Line 1                       */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  struct
  {
    uint32_t EINT:2;                    /**< bit:   0..1  Enable Interrupt Line x                       */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_ILE_bits_t;

#define MCAN_ILE_EINT0_Pos                    (0)                                            /**< (MCAN_ILE) Enable Interrupt Line 0 Position */
#define MCAN_ILE_EINT0_Msk                    (0x1U << MCAN_ILE_EINT0_Pos)                   /**< (MCAN_ILE) Enable Interrupt Line 0 Mask */
#define MCAN_ILE_EINT1_Pos                    (1)                                            /**< (MCAN_ILE) Enable Interrupt Line 1 Position */
#define MCAN_ILE_EINT1_Msk                    (0x1U << MCAN_ILE_EINT1_Pos)                   /**< (MCAN_ILE) Enable Interrupt Line 1 Mask */
#define MCAN_ILE_Msk                          (0x00000003UL)                                 /**< (MCAN_ILE) Register Mask  */
#define MCAN_ILE_EINT_Pos                     (0)                                            /**< (MCAN_ILE Position) Enable Interrupt Line x */
#define MCAN_ILE_EINT_Msk                     (0x3U << MCAN_ILE_EINT_Pos)                    /**< (MCAN_ILE Mask) EINT */
#define MCAN_ILE_EINT(value)                  (MCAN_ILE_EINT_Msk & ((value) << MCAN_ILE_EINT_Pos))

/* -------- MCAN_GFC : (MCAN Offset: 0x80) (R/W 32) Global Filter Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t RRFE:1;                    /**< bit:      0  Reject Remote Frames Extended                 */
    uint32_t RRFS:1;                    /**< bit:      1  Reject Remote Frames Standard                 */
    uint32_t ANFE:2;                    /**< bit:   2..3  Accept Non-matching Frames Extended           */
    uint32_t ANFS:2;                    /**< bit:   4..5  Accept Non-matching Frames Standard           */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_GFC_bits_t;

#define MCAN_GFC_RRFE_Pos                     (0)                                            /**< (MCAN_GFC) Reject Remote Frames Extended Position */
#define MCAN_GFC_RRFE_Msk                     (0x1U << MCAN_GFC_RRFE_Pos)                    /**< (MCAN_GFC) Reject Remote Frames Extended Mask */
#define   MCAN_GFC_RRFE_FILTER_Val            (0x0U)                                         /**< (MCAN_GFC) Filter remote frames with 29-bit extended IDs.  */
#define   MCAN_GFC_RRFE_REJECT_Val            (0x1U)                                         /**< (MCAN_GFC) Reject all remote frames with 29-bit extended IDs.  */
#define MCAN_GFC_RRFE_FILTER                  (MCAN_GFC_RRFE_FILTER_Val << MCAN_GFC_RRFE_Pos)  /**< (MCAN_GFC) Filter remote frames with 29-bit extended IDs. Position  */
#define MCAN_GFC_RRFE_REJECT                  (MCAN_GFC_RRFE_REJECT_Val << MCAN_GFC_RRFE_Pos)  /**< (MCAN_GFC) Reject all remote frames with 29-bit extended IDs. Position  */
#define MCAN_GFC_RRFS_Pos                     (1)                                            /**< (MCAN_GFC) Reject Remote Frames Standard Position */
#define MCAN_GFC_RRFS_Msk                     (0x1U << MCAN_GFC_RRFS_Pos)                    /**< (MCAN_GFC) Reject Remote Frames Standard Mask */
#define   MCAN_GFC_RRFS_FILTER_Val            (0x0U)                                         /**< (MCAN_GFC) Filter remote frames with 11-bit standard IDs.  */
#define   MCAN_GFC_RRFS_REJECT_Val            (0x1U)                                         /**< (MCAN_GFC) Reject all remote frames with 11-bit standard IDs.  */
#define MCAN_GFC_RRFS_FILTER                  (MCAN_GFC_RRFS_FILTER_Val << MCAN_GFC_RRFS_Pos)  /**< (MCAN_GFC) Filter remote frames with 11-bit standard IDs. Position  */
#define MCAN_GFC_RRFS_REJECT                  (MCAN_GFC_RRFS_REJECT_Val << MCAN_GFC_RRFS_Pos)  /**< (MCAN_GFC) Reject all remote frames with 11-bit standard IDs. Position  */
#define MCAN_GFC_ANFE_Pos                     (2)                                            /**< (MCAN_GFC) Accept Non-matching Frames Extended Position */
#define MCAN_GFC_ANFE_Msk                     (0x3U << MCAN_GFC_ANFE_Pos)                    /**< (MCAN_GFC) Accept Non-matching Frames Extended Mask */
#define MCAN_GFC_ANFE(value)                  (MCAN_GFC_ANFE_Msk & ((value) << MCAN_GFC_ANFE_Pos))
#define   MCAN_GFC_ANFE_RX_FIFO_0_Val         (0x0U)                                         /**< (MCAN_GFC) Accept in Rx FIFO 0  */
#define   MCAN_GFC_ANFE_RX_FIFO_1_Val         (0x1U)                                         /**< (MCAN_GFC) Accept in Rx FIFO 1  */
#define MCAN_GFC_ANFE_RX_FIFO_0               (MCAN_GFC_ANFE_RX_FIFO_0_Val << MCAN_GFC_ANFE_Pos)  /**< (MCAN_GFC) Accept in Rx FIFO 0 Position  */
#define MCAN_GFC_ANFE_RX_FIFO_1               (MCAN_GFC_ANFE_RX_FIFO_1_Val << MCAN_GFC_ANFE_Pos)  /**< (MCAN_GFC) Accept in Rx FIFO 1 Position  */
#define MCAN_GFC_ANFS_Pos                     (4)                                            /**< (MCAN_GFC) Accept Non-matching Frames Standard Position */
#define MCAN_GFC_ANFS_Msk                     (0x3U << MCAN_GFC_ANFS_Pos)                    /**< (MCAN_GFC) Accept Non-matching Frames Standard Mask */
#define MCAN_GFC_ANFS(value)                  (MCAN_GFC_ANFS_Msk & ((value) << MCAN_GFC_ANFS_Pos))
#define   MCAN_GFC_ANFS_RX_FIFO_0_Val         (0x0U)                                         /**< (MCAN_GFC) Accept in Rx FIFO 0  */
#define   MCAN_GFC_ANFS_RX_FIFO_1_Val         (0x1U)                                         /**< (MCAN_GFC) Accept in Rx FIFO 1  */
#define MCAN_GFC_ANFS_RX_FIFO_0               (MCAN_GFC_ANFS_RX_FIFO_0_Val << MCAN_GFC_ANFS_Pos)  /**< (MCAN_GFC) Accept in Rx FIFO 0 Position  */
#define MCAN_GFC_ANFS_RX_FIFO_1               (MCAN_GFC_ANFS_RX_FIFO_1_Val << MCAN_GFC_ANFS_Pos)  /**< (MCAN_GFC) Accept in Rx FIFO 1 Position  */
#define MCAN_GFC_Msk                          (0x0000003FUL)                                 /**< (MCAN_GFC) Register Mask  */

/* -------- MCAN_SIDFC : (MCAN Offset: 0x84) (R/W 32) Standard ID Filter Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t FLSSA:14;                  /**< bit:  2..15  Filter List Standard Start Address            */
    uint32_t LSS:8;                     /**< bit: 16..23  List Size Standard                            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_SIDFC_bits_t;

#define MCAN_SIDFC_FLSSA_Pos                  (2)                                            /**< (MCAN_SIDFC) Filter List Standard Start Address Position */
#define MCAN_SIDFC_FLSSA_Msk                  (0x3FFFU << MCAN_SIDFC_FLSSA_Pos)              /**< (MCAN_SIDFC) Filter List Standard Start Address Mask */
#define MCAN_SIDFC_FLSSA(value)               (MCAN_SIDFC_FLSSA_Msk & ((value) << MCAN_SIDFC_FLSSA_Pos))
#define MCAN_SIDFC_LSS_Pos                    (16)                                           /**< (MCAN_SIDFC) List Size Standard Position */
#define MCAN_SIDFC_LSS_Msk                    (0xFFU << MCAN_SIDFC_LSS_Pos)                  /**< (MCAN_SIDFC) List Size Standard Mask */
#define MCAN_SIDFC_LSS(value)                 (MCAN_SIDFC_LSS_Msk & ((value) << MCAN_SIDFC_LSS_Pos))
#define MCAN_SIDFC_Msk                        (0x00FFFFFCUL)                                 /**< (MCAN_SIDFC) Register Mask  */

/* -------- MCAN_XIDFC : (MCAN Offset: 0x88) (R/W 32) Extended ID Filter Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t FLESA:14;                  /**< bit:  2..15  Filter List Extended Start Address            */
    uint32_t LSE:7;                     /**< bit: 16..22  List Size Extended                            */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_XIDFC_bits_t;

#define MCAN_XIDFC_FLESA_Pos                  (2)                                            /**< (MCAN_XIDFC) Filter List Extended Start Address Position */
#define MCAN_XIDFC_FLESA_Msk                  (0x3FFFU << MCAN_XIDFC_FLESA_Pos)              /**< (MCAN_XIDFC) Filter List Extended Start Address Mask */
#define MCAN_XIDFC_FLESA(value)               (MCAN_XIDFC_FLESA_Msk & ((value) << MCAN_XIDFC_FLESA_Pos))
#define MCAN_XIDFC_LSE_Pos                    (16)                                           /**< (MCAN_XIDFC) List Size Extended Position */
#define MCAN_XIDFC_LSE_Msk                    (0x7FU << MCAN_XIDFC_LSE_Pos)                  /**< (MCAN_XIDFC) List Size Extended Mask */
#define MCAN_XIDFC_LSE(value)                 (MCAN_XIDFC_LSE_Msk & ((value) << MCAN_XIDFC_LSE_Pos))
#define MCAN_XIDFC_Msk                        (0x007FFFFCUL)                                 /**< (MCAN_XIDFC) Register Mask  */

/* -------- MCAN_XIDAM : (MCAN Offset: 0x90) (R/W 32) Extended ID AND Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t EIDM:29;                   /**< bit:  0..28  Extended ID Mask                              */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_XIDAM_bits_t;

#define MCAN_XIDAM_EIDM_Pos                   (0)                                            /**< (MCAN_XIDAM) Extended ID Mask Position */
#define MCAN_XIDAM_EIDM_Msk                   (0x1FFFFFFFU << MCAN_XIDAM_EIDM_Pos)           /**< (MCAN_XIDAM) Extended ID Mask Mask */
#define MCAN_XIDAM_EIDM(value)                (MCAN_XIDAM_EIDM_Msk & ((value) << MCAN_XIDAM_EIDM_Pos))
#define MCAN_XIDAM_Msk                        (0x1FFFFFFFUL)                                 /**< (MCAN_XIDAM) Register Mask  */

/* -------- MCAN_HPMS : (MCAN Offset: 0x94) (R/ 32) High Priority Message Status Register -------- */

typedef union
{
  struct
  {
    uint32_t BIDX:6;                    /**< bit:   0..5  Buffer Index                                  */
    uint32_t MSI:2;                     /**< bit:   6..7  Message Storage Indicator                     */
    uint32_t FIDX:7;                    /**< bit:  8..14  Filter Index                                  */
    uint32_t FLST:1;                    /**< bit:     15  Filter List                                   */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_HPMS_bits_t;

