zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
#define MCAN_HPMS_BIDX_Pos                    (0)                                            /**< (MCAN_HPMS) Buffer Index Position */
#define MCAN_HPMS_BIDX_Msk                    (0x3FU << MCAN_HPMS_BIDX_Pos)                  /**< (MCAN_HPMS) Buffer Index Mask */
#define MCAN_HPMS_BIDX(value)                 (MCAN_HPMS_BIDX_Msk & ((value) << MCAN_HPMS_BIDX_Pos))
#define MCAN_HPMS_MSI_Pos                     (6)                                            /**< (MCAN_HPMS) Message Storage Indicator Position */
#define MCAN_HPMS_MSI_Msk                     (0x3U << MCAN_HPMS_MSI_Pos)                    /**< (MCAN_HPMS) Message Storage Indicator Mask */
#define MCAN_HPMS_MSI(value)                  (MCAN_HPMS_MSI_Msk & ((value) << MCAN_HPMS_MSI_Pos))
#define   MCAN_HPMS_MSI_NO_FIFO_SEL_Val       (0x0U)                                         /**< (MCAN_HPMS) No FIFO selected.  */
#define   MCAN_HPMS_MSI_LOST_Val              (0x1U)                                         /**< (MCAN_HPMS) FIFO message lost.  */
#define   MCAN_HPMS_MSI_FIFO_0_Val            (0x2U)                                         /**< (MCAN_HPMS) Message stored in FIFO 0.  */
#define   MCAN_HPMS_MSI_FIFO_1_Val            (0x3U)                                         /**< (MCAN_HPMS) Message stored in FIFO 1.  */
#define MCAN_HPMS_MSI_NO_FIFO_SEL             (MCAN_HPMS_MSI_NO_FIFO_SEL_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) No FIFO selected. Position  */
#define MCAN_HPMS_MSI_LOST                    (MCAN_HPMS_MSI_LOST_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) FIFO message lost. Position  */
#define MCAN_HPMS_MSI_FIFO_0                  (MCAN_HPMS_MSI_FIFO_0_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) Message stored in FIFO 0. Position  */
#define MCAN_HPMS_MSI_FIFO_1                  (MCAN_HPMS_MSI_FIFO_1_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) Message stored in FIFO 1. Position  */
#define MCAN_HPMS_FIDX_Pos                    (8)                                            /**< (MCAN_HPMS) Filter Index Position */
#define MCAN_HPMS_FIDX_Msk                    (0x7FU << MCAN_HPMS_FIDX_Pos)                  /**< (MCAN_HPMS) Filter Index Mask */
#define MCAN_HPMS_FIDX(value)                 (MCAN_HPMS_FIDX_Msk & ((value) << MCAN_HPMS_FIDX_Pos))
#define MCAN_HPMS_FLST_Pos                    (15)                                           /**< (MCAN_HPMS) Filter List Position */
#define MCAN_HPMS_FLST_Msk                    (0x1U << MCAN_HPMS_FLST_Pos)                   /**< (MCAN_HPMS) Filter List Mask */
#define MCAN_HPMS_Msk                         (0x0000FFFFUL)                                 /**< (MCAN_HPMS) Register Mask  */

/* -------- MCAN_NDAT1 : (MCAN Offset: 0x98) (R/W 32) New Data 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t ND0:1;                     /**< bit:      0  New Data                                      */
    uint32_t ND1:1;                     /**< bit:      1  New Data                                      */
    uint32_t ND2:1;                     /**< bit:      2  New Data                                      */
    uint32_t ND3:1;                     /**< bit:      3  New Data                                      */
    uint32_t ND4:1;                     /**< bit:      4  New Data                                      */
    uint32_t ND5:1;                     /**< bit:      5  New Data                                      */
    uint32_t ND6:1;                     /**< bit:      6  New Data                                      */
    uint32_t ND7:1;                     /**< bit:      7  New Data                                      */
    uint32_t ND8:1;                     /**< bit:      8  New Data                                      */
    uint32_t ND9:1;                     /**< bit:      9  New Data                                      */
    uint32_t ND10:1;                    /**< bit:     10  New Data                                      */
    uint32_t ND11:1;                    /**< bit:     11  New Data                                      */
    uint32_t ND12:1;                    /**< bit:     12  New Data                                      */
    uint32_t ND13:1;                    /**< bit:     13  New Data                                      */
    uint32_t ND14:1;                    /**< bit:     14  New Data                                      */
    uint32_t ND15:1;                    /**< bit:     15  New Data                                      */
    uint32_t ND16:1;                    /**< bit:     16  New Data                                      */
    uint32_t ND17:1;                    /**< bit:     17  New Data                                      */
    uint32_t ND18:1;                    /**< bit:     18  New Data                                      */
    uint32_t ND19:1;                    /**< bit:     19  New Data                                      */
    uint32_t ND20:1;                    /**< bit:     20  New Data                                      */
    uint32_t ND21:1;                    /**< bit:     21  New Data                                      */
    uint32_t ND22:1;                    /**< bit:     22  New Data                                      */
    uint32_t ND23:1;                    /**< bit:     23  New Data                                      */
    uint32_t ND24:1;                    /**< bit:     24  New Data                                      */
    uint32_t ND25:1;                    /**< bit:     25  New Data                                      */
    uint32_t ND26:1;                    /**< bit:     26  New Data                                      */
    uint32_t ND27:1;                    /**< bit:     27  New Data                                      */
    uint32_t ND28:1;                    /**< bit:     28  New Data                                      */
    uint32_t ND29:1;                    /**< bit:     29  New Data                                      */
    uint32_t ND30:1;                    /**< bit:     30  New Data                                      */
    uint32_t ND31:1;                    /**< bit:     31  New Data                                      */
  };
  struct
  {
    uint32_t ND:32;                     /**< bit:  0..31  New Data                                      */
  };
  uint32_t w;
} __MCAN_NDAT1_bits_t;

#define MCAN_NDAT1_ND0_Pos                    (0)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND0_Msk                    (0x1U << MCAN_NDAT1_ND0_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND1_Pos                    (1)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND1_Msk                    (0x1U << MCAN_NDAT1_ND1_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND2_Pos                    (2)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND2_Msk                    (0x1U << MCAN_NDAT1_ND2_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND3_Pos                    (3)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND3_Msk                    (0x1U << MCAN_NDAT1_ND3_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND4_Pos                    (4)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND4_Msk                    (0x1U << MCAN_NDAT1_ND4_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND5_Pos                    (5)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND5_Msk                    (0x1U << MCAN_NDAT1_ND5_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND6_Pos                    (6)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND6_Msk                    (0x1U << MCAN_NDAT1_ND6_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND7_Pos                    (7)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND7_Msk                    (0x1U << MCAN_NDAT1_ND7_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND8_Pos                    (8)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND8_Msk                    (0x1U << MCAN_NDAT1_ND8_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND9_Pos                    (9)                                            /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND9_Msk                    (0x1U << MCAN_NDAT1_ND9_Pos)                   /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND10_Pos                   (10)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND10_Msk                   (0x1U << MCAN_NDAT1_ND10_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND11_Pos                   (11)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND11_Msk                   (0x1U << MCAN_NDAT1_ND11_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND12_Pos                   (12)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND12_Msk                   (0x1U << MCAN_NDAT1_ND12_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND13_Pos                   (13)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND13_Msk                   (0x1U << MCAN_NDAT1_ND13_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND14_Pos                   (14)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND14_Msk                   (0x1U << MCAN_NDAT1_ND14_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND15_Pos                   (15)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND15_Msk                   (0x1U << MCAN_NDAT1_ND15_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND16_Pos                   (16)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND16_Msk                   (0x1U << MCAN_NDAT1_ND16_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND17_Pos                   (17)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND17_Msk                   (0x1U << MCAN_NDAT1_ND17_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND18_Pos                   (18)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND18_Msk                   (0x1U << MCAN_NDAT1_ND18_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND19_Pos                   (19)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND19_Msk                   (0x1U << MCAN_NDAT1_ND19_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND20_Pos                   (20)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND20_Msk                   (0x1U << MCAN_NDAT1_ND20_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND21_Pos                   (21)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND21_Msk                   (0x1U << MCAN_NDAT1_ND21_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND22_Pos                   (22)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND22_Msk                   (0x1U << MCAN_NDAT1_ND22_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND23_Pos                   (23)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND23_Msk                   (0x1U << MCAN_NDAT1_ND23_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND24_Pos                   (24)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND24_Msk                   (0x1U << MCAN_NDAT1_ND24_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND25_Pos                   (25)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND25_Msk                   (0x1U << MCAN_NDAT1_ND25_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND26_Pos                   (26)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND26_Msk                   (0x1U << MCAN_NDAT1_ND26_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND27_Pos                   (27)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND27_Msk                   (0x1U << MCAN_NDAT1_ND27_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND28_Pos                   (28)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND28_Msk                   (0x1U << MCAN_NDAT1_ND28_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND29_Pos                   (29)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND29_Msk                   (0x1U << MCAN_NDAT1_ND29_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND30_Pos                   (30)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND30_Msk                   (0x1U << MCAN_NDAT1_ND30_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_ND31_Pos                   (31)                                           /**< (MCAN_NDAT1) New Data Position */
#define MCAN_NDAT1_ND31_Msk                   (0x1U << MCAN_NDAT1_ND31_Pos)                  /**< (MCAN_NDAT1) New Data Mask */
#define MCAN_NDAT1_Msk                        (0xFFFFFFFFUL)                                 /**< (MCAN_NDAT1) Register Mask  */
#define MCAN_NDAT1_ND_Pos                     (0)                                            /**< (MCAN_NDAT1 Position) New Data */
#define MCAN_NDAT1_ND_Msk                     (0xFFFFFFFFU << MCAN_NDAT1_ND_Pos)             /**< (MCAN_NDAT1 Mask) ND */
#define MCAN_NDAT1_ND(value)                  (MCAN_NDAT1_ND_Msk & ((value) << MCAN_NDAT1_ND_Pos))

/* -------- MCAN_NDAT2 : (MCAN Offset: 0x9c) (R/W 32) New Data 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t ND32:1;                    /**< bit:      0  New Data                                      */
    uint32_t ND33:1;                    /**< bit:      1  New Data                                      */
    uint32_t ND34:1;                    /**< bit:      2  New Data                                      */
    uint32_t ND35:1;                    /**< bit:      3  New Data                                      */
    uint32_t ND36:1;                    /**< bit:      4  New Data                                      */
    uint32_t ND37:1;                    /**< bit:      5  New Data                                      */
    uint32_t ND38:1;                    /**< bit:      6  New Data                                      */
    uint32_t ND39:1;                    /**< bit:      7  New Data                                      */
    uint32_t ND40:1;                    /**< bit:      8  New Data                                      */
    uint32_t ND41:1;                    /**< bit:      9  New Data                                      */
    uint32_t ND42:1;                    /**< bit:     10  New Data                                      */
    uint32_t ND43:1;                    /**< bit:     11  New Data                                      */
    uint32_t ND44:1;                    /**< bit:     12  New Data                                      */
    uint32_t ND45:1;                    /**< bit:     13  New Data                                      */
    uint32_t ND46:1;                    /**< bit:     14  New Data                                      */
    uint32_t ND47:1;                    /**< bit:     15  New Data                                      */
    uint32_t ND48:1;                    /**< bit:     16  New Data                                      */
    uint32_t ND49:1;                    /**< bit:     17  New Data                                      */
    uint32_t ND50:1;                    /**< bit:     18  New Data                                      */
    uint32_t ND51:1;                    /**< bit:     19  New Data                                      */
    uint32_t ND52:1;                    /**< bit:     20  New Data                                      */
    uint32_t ND53:1;                    /**< bit:     21  New Data                                      */
    uint32_t ND54:1;                    /**< bit:     22  New Data                                      */
    uint32_t ND55:1;                    /**< bit:     23  New Data                                      */
    uint32_t ND56:1;                    /**< bit:     24  New Data                                      */
    uint32_t ND57:1;                    /**< bit:     25  New Data                                      */
    uint32_t ND58:1;                    /**< bit:     26  New Data                                      */
    uint32_t ND59:1;                    /**< bit:     27  New Data                                      */
    uint32_t ND60:1;                    /**< bit:     28  New Data                                      */
    uint32_t ND61:1;                    /**< bit:     29  New Data                                      */
    uint32_t ND62:1;                    /**< bit:     30  New Data                                      */
    uint32_t ND63:1;                    /**< bit:     31  New Data                                      */
  };
  struct
  {
    uint32_t ND:32;                     /**< bit:  0..31  New Data                                      */
  };
  uint32_t w;
} __MCAN_NDAT2_bits_t;

