zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
/* -------- MCAN_RXF0C : (MCAN Offset: 0xa0) (R/W 32) Receive FIFO 0 Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t F0SA:14;                   /**< bit:  2..15  Receive FIFO 0 Start Address                  */
    uint32_t F0S:7;                     /**< bit: 16..22  Receive FIFO 0 Start Address                  */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t F0WM:7;                    /**< bit: 24..30  Receive FIFO 0 Watermark                      */
    uint32_t F0OM:1;                    /**< bit:     31  FIFO 0 Operation Mode                         */
  };
  uint32_t w;
} __MCAN_RXF0C_bits_t;

#define MCAN_RXF0C_F0SA_Pos                   (2)                                            /**< (MCAN_RXF0C) Receive FIFO 0 Start Address Position */
#define MCAN_RXF0C_F0SA_Msk                   (0x3FFFU << MCAN_RXF0C_F0SA_Pos)               /**< (MCAN_RXF0C) Receive FIFO 0 Start Address Mask */
#define MCAN_RXF0C_F0SA(value)                (MCAN_RXF0C_F0SA_Msk & ((value) << MCAN_RXF0C_F0SA_Pos))
#define MCAN_RXF0C_F0S_Pos                    (16)                                           /**< (MCAN_RXF0C) Receive FIFO 0 Start Address Position */
#define MCAN_RXF0C_F0S_Msk                    (0x7FU << MCAN_RXF0C_F0S_Pos)                  /**< (MCAN_RXF0C) Receive FIFO 0 Start Address Mask */
#define MCAN_RXF0C_F0S(value)                 (MCAN_RXF0C_F0S_Msk & ((value) << MCAN_RXF0C_F0S_Pos))
#define MCAN_RXF0C_F0WM_Pos                   (24)                                           /**< (MCAN_RXF0C) Receive FIFO 0 Watermark Position */
#define MCAN_RXF0C_F0WM_Msk                   (0x7FU << MCAN_RXF0C_F0WM_Pos)                 /**< (MCAN_RXF0C) Receive FIFO 0 Watermark Mask */
#define MCAN_RXF0C_F0WM(value)                (MCAN_RXF0C_F0WM_Msk & ((value) << MCAN_RXF0C_F0WM_Pos))
#define MCAN_RXF0C_F0OM_Pos                   (31)                                           /**< (MCAN_RXF0C) FIFO 0 Operation Mode Position */
#define MCAN_RXF0C_F0OM_Msk                   (0x1U << MCAN_RXF0C_F0OM_Pos)                  /**< (MCAN_RXF0C) FIFO 0 Operation Mode Mask */
#define MCAN_RXF0C_Msk                        (0xFF7FFFFCUL)                                 /**< (MCAN_RXF0C) Register Mask  */

/* -------- MCAN_RXF0S : (MCAN Offset: 0xa4) (R/ 32) Receive FIFO 0 Status Register -------- */

typedef union
{
  struct
  {
    uint32_t F0FL:7;                    /**< bit:   0..6  Receive FIFO 0 Fill Level                     */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t F0GI:6;                    /**< bit:  8..13  Receive FIFO 0 Get Index                      */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t F0PI:6;                    /**< bit: 16..21  Receive FIFO 0 Put Index                      */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t F0F:1;                     /**< bit:     24  Receive FIFO 0 Fill Level                     */
    uint32_t RF0L:1;                    /**< bit:     25  Receive FIFO 0 Message Lost                   */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_RXF0S_bits_t;

#define MCAN_RXF0S_F0FL_Pos                   (0)                                            /**< (MCAN_RXF0S) Receive FIFO 0 Fill Level Position */
#define MCAN_RXF0S_F0FL_Msk                   (0x7FU << MCAN_RXF0S_F0FL_Pos)                 /**< (MCAN_RXF0S) Receive FIFO 0 Fill Level Mask */
#define MCAN_RXF0S_F0FL(value)                (MCAN_RXF0S_F0FL_Msk & ((value) << MCAN_RXF0S_F0FL_Pos))
#define MCAN_RXF0S_F0GI_Pos                   (8)                                            /**< (MCAN_RXF0S) Receive FIFO 0 Get Index Position */
#define MCAN_RXF0S_F0GI_Msk                   (0x3FU << MCAN_RXF0S_F0GI_Pos)                 /**< (MCAN_RXF0S) Receive FIFO 0 Get Index Mask */
#define MCAN_RXF0S_F0GI(value)                (MCAN_RXF0S_F0GI_Msk & ((value) << MCAN_RXF0S_F0GI_Pos))
#define MCAN_RXF0S_F0PI_Pos                   (16)                                           /**< (MCAN_RXF0S) Receive FIFO 0 Put Index Position */
#define MCAN_RXF0S_F0PI_Msk                   (0x3FU << MCAN_RXF0S_F0PI_Pos)                 /**< (MCAN_RXF0S) Receive FIFO 0 Put Index Mask */
#define MCAN_RXF0S_F0PI(value)                (MCAN_RXF0S_F0PI_Msk & ((value) << MCAN_RXF0S_F0PI_Pos))
#define MCAN_RXF0S_F0F_Pos                    (24)                                           /**< (MCAN_RXF0S) Receive FIFO 0 Fill Level Position */
#define MCAN_RXF0S_F0F_Msk                    (0x1U << MCAN_RXF0S_F0F_Pos)                   /**< (MCAN_RXF0S) Receive FIFO 0 Fill Level Mask */
#define MCAN_RXF0S_RF0L_Pos                   (25)                                           /**< (MCAN_RXF0S) Receive FIFO 0 Message Lost Position */
#define MCAN_RXF0S_RF0L_Msk                   (0x1U << MCAN_RXF0S_RF0L_Pos)                  /**< (MCAN_RXF0S) Receive FIFO 0 Message Lost Mask */
#define MCAN_RXF0S_Msk                        (0x033F3F7FUL)                                 /**< (MCAN_RXF0S) Register Mask  */

/* -------- MCAN_RXF0A : (MCAN Offset: 0xa8) (R/W 32) Receive FIFO 0 Acknowledge Register -------- */

typedef union
{
  struct
  {
    uint32_t F0AI:6;                    /**< bit:   0..5  Receive FIFO 0 Acknowledge Index              */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_RXF0A_bits_t;

#define MCAN_RXF0A_F0AI_Pos                   (0)                                            /**< (MCAN_RXF0A) Receive FIFO 0 Acknowledge Index Position */
#define MCAN_RXF0A_F0AI_Msk                   (0x3FU << MCAN_RXF0A_F0AI_Pos)                 /**< (MCAN_RXF0A) Receive FIFO 0 Acknowledge Index Mask */
#define MCAN_RXF0A_F0AI(value)                (MCAN_RXF0A_F0AI_Msk & ((value) << MCAN_RXF0A_F0AI_Pos))
#define MCAN_RXF0A_Msk                        (0x0000003FUL)                                 /**< (MCAN_RXF0A) Register Mask  */

/* -------- MCAN_RXBC : (MCAN Offset: 0xac) (R/W 32) Receive Rx Buffer Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RBSA:14;                   /**< bit:  2..15  Receive Buffer Start Address                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_RXBC_bits_t;

