zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
/* -------- MCAN_TXESC : (MCAN Offset: 0xc8) (R/W 32) Transmit Buffer Element Size Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t TBDS:3;                    /**< bit:   0..2  Tx Buffer Data Field Size                     */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_TXESC_bits_t;

#define MCAN_TXESC_TBDS_Pos                   (0)                                            /**< (MCAN_TXESC) Tx Buffer Data Field Size Position */
#define MCAN_TXESC_TBDS_Msk                   (0x7U << MCAN_TXESC_TBDS_Pos)                  /**< (MCAN_TXESC) Tx Buffer Data Field Size Mask */
#define MCAN_TXESC_TBDS(value)                (MCAN_TXESC_TBDS_Msk & ((value) << MCAN_TXESC_TBDS_Pos))
#define   MCAN_TXESC_TBDS_8_BYTE_Val          (0x0U)                                         /**< (MCAN_TXESC) 8-byte data field  */
#define   MCAN_TXESC_TBDS_12_BYTE_Val         (0x1U)                                         /**< (MCAN_TXESC) 12-byte data field  */
#define   MCAN_TXESC_TBDS_16_BYTE_Val         (0x2U)                                         /**< (MCAN_TXESC) 16-byte data field  */
#define   MCAN_TXESC_TBDS_20_BYTE_Val         (0x3U)                                         /**< (MCAN_TXESC) 20-byte data field  */
#define   MCAN_TXESC_TBDS_24_BYTE_Val         (0x4U)                                         /**< (MCAN_TXESC) 24-byte data field  */
#define   MCAN_TXESC_TBDS_32_BYTE_Val         (0x5U)                                         /**< (MCAN_TXESC) 32-byte data field  */
#define   MCAN_TXESC_TBDS_48_BYTE_Val         (0x6U)                                         /**< (MCAN_TXESC) 48- byte data field  */
#define   MCAN_TXESC_TBDS_64_BYTE_Val         (0x7U)                                         /**< (MCAN_TXESC) 64-byte data field  */
#define MCAN_TXESC_TBDS_8_BYTE                (MCAN_TXESC_TBDS_8_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 8-byte data field Position  */
#define MCAN_TXESC_TBDS_12_BYTE               (MCAN_TXESC_TBDS_12_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 12-byte data field Position  */
#define MCAN_TXESC_TBDS_16_BYTE               (MCAN_TXESC_TBDS_16_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 16-byte data field Position  */
#define MCAN_TXESC_TBDS_20_BYTE               (MCAN_TXESC_TBDS_20_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 20-byte data field Position  */
#define MCAN_TXESC_TBDS_24_BYTE               (MCAN_TXESC_TBDS_24_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 24-byte data field Position  */
#define MCAN_TXESC_TBDS_32_BYTE               (MCAN_TXESC_TBDS_32_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 32-byte data field Position  */
#define MCAN_TXESC_TBDS_48_BYTE               (MCAN_TXESC_TBDS_48_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 48- byte data field Position  */
#define MCAN_TXESC_TBDS_64_BYTE               (MCAN_TXESC_TBDS_64_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 64-byte data field Position  */
#define MCAN_TXESC_Msk                        (0x00000007UL)                                 /**< (MCAN_TXESC) Register Mask  */

/* -------- MCAN_TXBRP : (MCAN Offset: 0xcc) (R/ 32) Transmit Buffer Request Pending Register -------- */

typedef union
{
  struct
  {
    uint32_t TRP0:1;                    /**< bit:      0  Transmission Request Pending for Buffer 0     */
    uint32_t TRP1:1;                    /**< bit:      1  Transmission Request Pending for Buffer 1     */
    uint32_t TRP2:1;                    /**< bit:      2  Transmission Request Pending for Buffer 2     */
    uint32_t TRP3:1;                    /**< bit:      3  Transmission Request Pending for Buffer 3     */
    uint32_t TRP4:1;                    /**< bit:      4  Transmission Request Pending for Buffer 4     */
    uint32_t TRP5:1;                    /**< bit:      5  Transmission Request Pending for Buffer 5     */
    uint32_t TRP6:1;                    /**< bit:      6  Transmission Request Pending for Buffer 6     */
    uint32_t TRP7:1;                    /**< bit:      7  Transmission Request Pending for Buffer 7     */
    uint32_t TRP8:1;                    /**< bit:      8  Transmission Request Pending for Buffer 8     */
    uint32_t TRP9:1;                    /**< bit:      9  Transmission Request Pending for Buffer 9     */
    uint32_t TRP10:1;                   /**< bit:     10  Transmission Request Pending for Buffer 10    */
    uint32_t TRP11:1;                   /**< bit:     11  Transmission Request Pending for Buffer 11    */
    uint32_t TRP12:1;                   /**< bit:     12  Transmission Request Pending for Buffer 12    */
    uint32_t TRP13:1;                   /**< bit:     13  Transmission Request Pending for Buffer 13    */
    uint32_t TRP14:1;                   /**< bit:     14  Transmission Request Pending for Buffer 14    */
    uint32_t TRP15:1;                   /**< bit:     15  Transmission Request Pending for Buffer 15    */
    uint32_t TRP16:1;                   /**< bit:     16  Transmission Request Pending for Buffer 16    */
    uint32_t TRP17:1;                   /**< bit:     17  Transmission Request Pending for Buffer 17    */
    uint32_t TRP18:1;                   /**< bit:     18  Transmission Request Pending for Buffer 18    */
    uint32_t TRP19:1;                   /**< bit:     19  Transmission Request Pending for Buffer 19    */
    uint32_t TRP20:1;                   /**< bit:     20  Transmission Request Pending for Buffer 20    */
    uint32_t TRP21:1;                   /**< bit:     21  Transmission Request Pending for Buffer 21    */
    uint32_t TRP22:1;                   /**< bit:     22  Transmission Request Pending for Buffer 22    */
    uint32_t TRP23:1;                   /**< bit:     23  Transmission Request Pending for Buffer 23    */
    uint32_t TRP24:1;                   /**< bit:     24  Transmission Request Pending for Buffer 24    */
    uint32_t TRP25:1;                   /**< bit:     25  Transmission Request Pending for Buffer 25    */
    uint32_t TRP26:1;                   /**< bit:     26  Transmission Request Pending for Buffer 26    */
    uint32_t TRP27:1;                   /**< bit:     27  Transmission Request Pending for Buffer 27    */
    uint32_t TRP28:1;                   /**< bit:     28  Transmission Request Pending for Buffer 28    */
    uint32_t TRP29:1;                   /**< bit:     29  Transmission Request Pending for Buffer 29    */
    uint32_t TRP30:1;                   /**< bit:     30  Transmission Request Pending for Buffer 30    */
    uint32_t TRP31:1;                   /**< bit:     31  Transmission Request Pending for Buffer 31    */
  };
  struct
  {
    uint32_t TRP:32;                    /**< bit:  0..31  Transmission Request Pending for Buffer 3x    */
  };
  uint32_t w;
} __MCAN_TXBRP_bits_t;

#define MCAN_TXBRP_TRP0_Pos                   (0)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 0 Position */
#define MCAN_TXBRP_TRP0_Msk                   (0x1U << MCAN_TXBRP_TRP0_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 0 Mask */
#define MCAN_TXBRP_TRP1_Pos                   (1)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 1 Position */
#define MCAN_TXBRP_TRP1_Msk                   (0x1U << MCAN_TXBRP_TRP1_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 1 Mask */
#define MCAN_TXBRP_TRP2_Pos                   (2)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 2 Position */
#define MCAN_TXBRP_TRP2_Msk                   (0x1U << MCAN_TXBRP_TRP2_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 2 Mask */
#define MCAN_TXBRP_TRP3_Pos                   (3)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 3 Position */
#define MCAN_TXBRP_TRP3_Msk                   (0x1U << MCAN_TXBRP_TRP3_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 3 Mask */
#define MCAN_TXBRP_TRP4_Pos                   (4)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 4 Position */
#define MCAN_TXBRP_TRP4_Msk                   (0x1U << MCAN_TXBRP_TRP4_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 4 Mask */
#define MCAN_TXBRP_TRP5_Pos                   (5)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 5 Position */
#define MCAN_TXBRP_TRP5_Msk                   (0x1U << MCAN_TXBRP_TRP5_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 5 Mask */
#define MCAN_TXBRP_TRP6_Pos                   (6)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 6 Position */
#define MCAN_TXBRP_TRP6_Msk                   (0x1U << MCAN_TXBRP_TRP6_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 6 Mask */
#define MCAN_TXBRP_TRP7_Pos                   (7)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 7 Position */
#define MCAN_TXBRP_TRP7_Msk                   (0x1U << MCAN_TXBRP_TRP7_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 7 Mask */
#define MCAN_TXBRP_TRP8_Pos                   (8)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 8 Position */
#define MCAN_TXBRP_TRP8_Msk                   (0x1U << MCAN_TXBRP_TRP8_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 8 Mask */
#define MCAN_TXBRP_TRP9_Pos                   (9)                                            /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 9 Position */
#define MCAN_TXBRP_TRP9_Msk                   (0x1U << MCAN_TXBRP_TRP9_Pos)                  /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 9 Mask */
#define MCAN_TXBRP_TRP10_Pos                  (10)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 10 Position */
#define MCAN_TXBRP_TRP10_Msk                  (0x1U << MCAN_TXBRP_TRP10_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 10 Mask */
#define MCAN_TXBRP_TRP11_Pos                  (11)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 11 Position */
#define MCAN_TXBRP_TRP11_Msk                  (0x1U << MCAN_TXBRP_TRP11_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 11 Mask */
#define MCAN_TXBRP_TRP12_Pos                  (12)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 12 Position */
#define MCAN_TXBRP_TRP12_Msk                  (0x1U << MCAN_TXBRP_TRP12_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 12 Mask */
#define MCAN_TXBRP_TRP13_Pos                  (13)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 13 Position */
#define MCAN_TXBRP_TRP13_Msk                  (0x1U << MCAN_TXBRP_TRP13_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 13 Mask */
#define MCAN_TXBRP_TRP14_Pos                  (14)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 14 Position */
#define MCAN_TXBRP_TRP14_Msk                  (0x1U << MCAN_TXBRP_TRP14_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 14 Mask */
#define MCAN_TXBRP_TRP15_Pos                  (15)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 15 Position */
#define MCAN_TXBRP_TRP15_Msk                  (0x1U << MCAN_TXBRP_TRP15_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 15 Mask */
#define MCAN_TXBRP_TRP16_Pos                  (16)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 16 Position */
#define MCAN_TXBRP_TRP16_Msk                  (0x1U << MCAN_TXBRP_TRP16_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 16 Mask */
#define MCAN_TXBRP_TRP17_Pos                  (17)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 17 Position */
#define MCAN_TXBRP_TRP17_Msk                  (0x1U << MCAN_TXBRP_TRP17_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 17 Mask */
#define MCAN_TXBRP_TRP18_Pos                  (18)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 18 Position */
#define MCAN_TXBRP_TRP18_Msk                  (0x1U << MCAN_TXBRP_TRP18_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 18 Mask */
#define MCAN_TXBRP_TRP19_Pos                  (19)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 19 Position */
#define MCAN_TXBRP_TRP19_Msk                  (0x1U << MCAN_TXBRP_TRP19_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 19 Mask */
#define MCAN_TXBRP_TRP20_Pos                  (20)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 20 Position */
#define MCAN_TXBRP_TRP20_Msk                  (0x1U << MCAN_TXBRP_TRP20_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 20 Mask */
#define MCAN_TXBRP_TRP21_Pos                  (21)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 21 Position */
#define MCAN_TXBRP_TRP21_Msk                  (0x1U << MCAN_TXBRP_TRP21_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 21 Mask */
#define MCAN_TXBRP_TRP22_Pos                  (22)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 22 Position */
#define MCAN_TXBRP_TRP22_Msk                  (0x1U << MCAN_TXBRP_TRP22_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 22 Mask */
#define MCAN_TXBRP_TRP23_Pos                  (23)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 23 Position */
#define MCAN_TXBRP_TRP23_Msk                  (0x1U << MCAN_TXBRP_TRP23_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 23 Mask */
#define MCAN_TXBRP_TRP24_Pos                  (24)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 24 Position */
#define MCAN_TXBRP_TRP24_Msk                  (0x1U << MCAN_TXBRP_TRP24_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 24 Mask */
#define MCAN_TXBRP_TRP25_Pos                  (25)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 25 Position */
#define MCAN_TXBRP_TRP25_Msk                  (0x1U << MCAN_TXBRP_TRP25_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 25 Mask */
#define MCAN_TXBRP_TRP26_Pos                  (26)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 26 Position */
#define MCAN_TXBRP_TRP26_Msk                  (0x1U << MCAN_TXBRP_TRP26_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 26 Mask */
#define MCAN_TXBRP_TRP27_Pos                  (27)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 27 Position */
#define MCAN_TXBRP_TRP27_Msk                  (0x1U << MCAN_TXBRP_TRP27_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 27 Mask */
#define MCAN_TXBRP_TRP28_Pos                  (28)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 28 Position */
#define MCAN_TXBRP_TRP28_Msk                  (0x1U << MCAN_TXBRP_TRP28_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 28 Mask */
#define MCAN_TXBRP_TRP29_Pos                  (29)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 29 Position */
#define MCAN_TXBRP_TRP29_Msk                  (0x1U << MCAN_TXBRP_TRP29_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 29 Mask */
#define MCAN_TXBRP_TRP30_Pos                  (30)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 30 Position */
#define MCAN_TXBRP_TRP30_Msk                  (0x1U << MCAN_TXBRP_TRP30_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 30 Mask */
#define MCAN_TXBRP_TRP31_Pos                  (31)                                           /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 31 Position */
#define MCAN_TXBRP_TRP31_Msk                  (0x1U << MCAN_TXBRP_TRP31_Pos)                 /**< (MCAN_TXBRP) Transmission Request Pending for Buffer 31 Mask */
#define MCAN_TXBRP_Msk                        (0xFFFFFFFFUL)                                 /**< (MCAN_TXBRP) Register Mask  */
#define MCAN_TXBRP_TRP_Pos                    (0)                                            /**< (MCAN_TXBRP Position) Transmission Request Pending for Buffer 3x */
#define MCAN_TXBRP_TRP_Msk                    (0xFFFFFFFFU << MCAN_TXBRP_TRP_Pos)            /**< (MCAN_TXBRP Mask) TRP */
#define MCAN_TXBRP_TRP(value)                 (MCAN_TXBRP_TRP_Msk & ((value) << MCAN_TXBRP_TRP_Pos))

/* -------- MCAN_TXBAR : (MCAN Offset: 0xd0) (R/W 32) Transmit Buffer Add Request Register -------- */

typedef union
{
  struct
  {
    uint32_t AR0:1;                     /**< bit:      0  Add Request for Transmit Buffer 0             */
    uint32_t AR1:1;                     /**< bit:      1  Add Request for Transmit Buffer 1             */
    uint32_t AR2:1;                     /**< bit:      2  Add Request for Transmit Buffer 2             */
    uint32_t AR3:1;                     /**< bit:      3  Add Request for Transmit Buffer 3             */
    uint32_t AR4:1;                     /**< bit:      4  Add Request for Transmit Buffer 4             */
    uint32_t AR5:1;                     /**< bit:      5  Add Request for Transmit Buffer 5             */
    uint32_t AR6:1;                     /**< bit:      6  Add Request for Transmit Buffer 6             */
    uint32_t AR7:1;                     /**< bit:      7  Add Request for Transmit Buffer 7             */
    uint32_t AR8:1;                     /**< bit:      8  Add Request for Transmit Buffer 8             */
    uint32_t AR9:1;                     /**< bit:      9  Add Request for Transmit Buffer 9             */
    uint32_t AR10:1;                    /**< bit:     10  Add Request for Transmit Buffer 10            */
    uint32_t AR11:1;                    /**< bit:     11  Add Request for Transmit Buffer 11            */
    uint32_t AR12:1;                    /**< bit:     12  Add Request for Transmit Buffer 12            */
    uint32_t AR13:1;                    /**< bit:     13  Add Request for Transmit Buffer 13            */
    uint32_t AR14:1;                    /**< bit:     14  Add Request for Transmit Buffer 14            */
    uint32_t AR15:1;                    /**< bit:     15  Add Request for Transmit Buffer 15            */
    uint32_t AR16:1;                    /**< bit:     16  Add Request for Transmit Buffer 16            */
    uint32_t AR17:1;                    /**< bit:     17  Add Request for Transmit Buffer 17            */
    uint32_t AR18:1;                    /**< bit:     18  Add Request for Transmit Buffer 18            */
    uint32_t AR19:1;                    /**< bit:     19  Add Request for Transmit Buffer 19            */
    uint32_t AR20:1;                    /**< bit:     20  Add Request for Transmit Buffer 20            */
    uint32_t AR21:1;                    /**< bit:     21  Add Request for Transmit Buffer 21            */
    uint32_t AR22:1;                    /**< bit:     22  Add Request for Transmit Buffer 22            */
    uint32_t AR23:1;                    /**< bit:     23  Add Request for Transmit Buffer 23            */
    uint32_t AR24:1;                    /**< bit:     24  Add Request for Transmit Buffer 24            */
    uint32_t AR25:1;                    /**< bit:     25  Add Request for Transmit Buffer 25            */
    uint32_t AR26:1;                    /**< bit:     26  Add Request for Transmit Buffer 26            */
    uint32_t AR27:1;                    /**< bit:     27  Add Request for Transmit Buffer 27            */
    uint32_t AR28:1;                    /**< bit:     28  Add Request for Transmit Buffer 28            */
    uint32_t AR29:1;                    /**< bit:     29  Add Request for Transmit Buffer 29            */
    uint32_t AR30:1;                    /**< bit:     30  Add Request for Transmit Buffer 30            */
    uint32_t AR31:1;                    /**< bit:     31  Add Request for Transmit Buffer 31            */
  };
  struct
  {
    uint32_t AR:32;                     /**< bit:  0..31  Add Request for Transmit Buffer 3x            */
  };
  uint32_t w;
} __MCAN_TXBAR_bits_t;

