zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
#define MCAN_TXBTO_TO0_Pos                    (0)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 0 Position */
#define MCAN_TXBTO_TO0_Msk                    (0x1U << MCAN_TXBTO_TO0_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 0 Mask */
#define MCAN_TXBTO_TO1_Pos                    (1)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 1 Position */
#define MCAN_TXBTO_TO1_Msk                    (0x1U << MCAN_TXBTO_TO1_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 1 Mask */
#define MCAN_TXBTO_TO2_Pos                    (2)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 2 Position */
#define MCAN_TXBTO_TO2_Msk                    (0x1U << MCAN_TXBTO_TO2_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 2 Mask */
#define MCAN_TXBTO_TO3_Pos                    (3)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 3 Position */
#define MCAN_TXBTO_TO3_Msk                    (0x1U << MCAN_TXBTO_TO3_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 3 Mask */
#define MCAN_TXBTO_TO4_Pos                    (4)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 4 Position */
#define MCAN_TXBTO_TO4_Msk                    (0x1U << MCAN_TXBTO_TO4_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 4 Mask */
#define MCAN_TXBTO_TO5_Pos                    (5)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 5 Position */
#define MCAN_TXBTO_TO5_Msk                    (0x1U << MCAN_TXBTO_TO5_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 5 Mask */
#define MCAN_TXBTO_TO6_Pos                    (6)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 6 Position */
#define MCAN_TXBTO_TO6_Msk                    (0x1U << MCAN_TXBTO_TO6_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 6 Mask */
#define MCAN_TXBTO_TO7_Pos                    (7)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 7 Position */
#define MCAN_TXBTO_TO7_Msk                    (0x1U << MCAN_TXBTO_TO7_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 7 Mask */
#define MCAN_TXBTO_TO8_Pos                    (8)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 8 Position */
#define MCAN_TXBTO_TO8_Msk                    (0x1U << MCAN_TXBTO_TO8_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 8 Mask */
#define MCAN_TXBTO_TO9_Pos                    (9)                                            /**< (MCAN_TXBTO) Transmission Occurred for Buffer 9 Position */
#define MCAN_TXBTO_TO9_Msk                    (0x1U << MCAN_TXBTO_TO9_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 9 Mask */
#define MCAN_TXBTO_TO10_Pos                   (10)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 10 Position */
#define MCAN_TXBTO_TO10_Msk                   (0x1U << MCAN_TXBTO_TO10_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 10 Mask */
#define MCAN_TXBTO_TO11_Pos                   (11)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 11 Position */
#define MCAN_TXBTO_TO11_Msk                   (0x1U << MCAN_TXBTO_TO11_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 11 Mask */
#define MCAN_TXBTO_TO12_Pos                   (12)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 12 Position */
#define MCAN_TXBTO_TO12_Msk                   (0x1U << MCAN_TXBTO_TO12_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 12 Mask */
#define MCAN_TXBTO_TO13_Pos                   (13)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 13 Position */
#define MCAN_TXBTO_TO13_Msk                   (0x1U << MCAN_TXBTO_TO13_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 13 Mask */
#define MCAN_TXBTO_TO14_Pos                   (14)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 14 Position */
#define MCAN_TXBTO_TO14_Msk                   (0x1U << MCAN_TXBTO_TO14_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 14 Mask */
#define MCAN_TXBTO_TO15_Pos                   (15)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 15 Position */
#define MCAN_TXBTO_TO15_Msk                   (0x1U << MCAN_TXBTO_TO15_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 15 Mask */
#define MCAN_TXBTO_TO16_Pos                   (16)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 16 Position */
#define MCAN_TXBTO_TO16_Msk                   (0x1U << MCAN_TXBTO_TO16_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 16 Mask */
#define MCAN_TXBTO_TO17_Pos                   (17)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 17 Position */
#define MCAN_TXBTO_TO17_Msk                   (0x1U << MCAN_TXBTO_TO17_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 17 Mask */
#define MCAN_TXBTO_TO18_Pos                   (18)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 18 Position */
#define MCAN_TXBTO_TO18_Msk                   (0x1U << MCAN_TXBTO_TO18_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 18 Mask */
#define MCAN_TXBTO_TO19_Pos                   (19)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 19 Position */
#define MCAN_TXBTO_TO19_Msk                   (0x1U << MCAN_TXBTO_TO19_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 19 Mask */
#define MCAN_TXBTO_TO20_Pos                   (20)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 20 Position */
#define MCAN_TXBTO_TO20_Msk                   (0x1U << MCAN_TXBTO_TO20_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 20 Mask */
#define MCAN_TXBTO_TO21_Pos                   (21)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 21 Position */
#define MCAN_TXBTO_TO21_Msk                   (0x1U << MCAN_TXBTO_TO21_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 21 Mask */
#define MCAN_TXBTO_TO22_Pos                   (22)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 22 Position */
#define MCAN_TXBTO_TO22_Msk                   (0x1U << MCAN_TXBTO_TO22_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 22 Mask */
#define MCAN_TXBTO_TO23_Pos                   (23)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 23 Position */
#define MCAN_TXBTO_TO23_Msk                   (0x1U << MCAN_TXBTO_TO23_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 23 Mask */
#define MCAN_TXBTO_TO24_Pos                   (24)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 24 Position */
#define MCAN_TXBTO_TO24_Msk                   (0x1U << MCAN_TXBTO_TO24_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 24 Mask */
#define MCAN_TXBTO_TO25_Pos                   (25)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 25 Position */
#define MCAN_TXBTO_TO25_Msk                   (0x1U << MCAN_TXBTO_TO25_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 25 Mask */
#define MCAN_TXBTO_TO26_Pos                   (26)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 26 Position */
#define MCAN_TXBTO_TO26_Msk                   (0x1U << MCAN_TXBTO_TO26_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 26 Mask */
#define MCAN_TXBTO_TO27_Pos                   (27)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 27 Position */
#define MCAN_TXBTO_TO27_Msk                   (0x1U << MCAN_TXBTO_TO27_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 27 Mask */
#define MCAN_TXBTO_TO28_Pos                   (28)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 28 Position */
#define MCAN_TXBTO_TO28_Msk                   (0x1U << MCAN_TXBTO_TO28_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 28 Mask */
#define MCAN_TXBTO_TO29_Pos                   (29)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 29 Position */
#define MCAN_TXBTO_TO29_Msk                   (0x1U << MCAN_TXBTO_TO29_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 29 Mask */
#define MCAN_TXBTO_TO30_Pos                   (30)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 30 Position */
#define MCAN_TXBTO_TO30_Msk                   (0x1U << MCAN_TXBTO_TO30_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 30 Mask */
#define MCAN_TXBTO_TO31_Pos                   (31)                                           /**< (MCAN_TXBTO) Transmission Occurred for Buffer 31 Position */
#define MCAN_TXBTO_TO31_Msk                   (0x1U << MCAN_TXBTO_TO31_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 31 Mask */
#define MCAN_TXBTO_Msk                        (0xFFFFFFFFUL)                                 /**< (MCAN_TXBTO) Register Mask  */
#define MCAN_TXBTO_TO_Pos                     (0)                                            /**< (MCAN_TXBTO Position) Transmission Occurred for Buffer 3x */
#define MCAN_TXBTO_TO_Msk                     (0xFFFFFFFFU << MCAN_TXBTO_TO_Pos)             /**< (MCAN_TXBTO Mask) TO */
#define MCAN_TXBTO_TO(value)                  (MCAN_TXBTO_TO_Msk & ((value) << MCAN_TXBTO_TO_Pos))

/* -------- MCAN_TXBCF : (MCAN Offset: 0xdc) (R/ 32) Transmit Buffer Cancellation Finished Register -------- */

typedef union
{
  struct
  {
    uint32_t CF0:1;                     /**< bit:      0  Cancellation Finished for Transmit Buffer 0   */
    uint32_t CF1:1;                     /**< bit:      1  Cancellation Finished for Transmit Buffer 1   */
    uint32_t CF2:1;                     /**< bit:      2  Cancellation Finished for Transmit Buffer 2   */
    uint32_t CF3:1;                     /**< bit:      3  Cancellation Finished for Transmit Buffer 3   */
    uint32_t CF4:1;                     /**< bit:      4  Cancellation Finished for Transmit Buffer 4   */
    uint32_t CF5:1;                     /**< bit:      5  Cancellation Finished for Transmit Buffer 5   */
    uint32_t CF6:1;                     /**< bit:      6  Cancellation Finished for Transmit Buffer 6   */
    uint32_t CF7:1;                     /**< bit:      7  Cancellation Finished for Transmit Buffer 7   */
    uint32_t CF8:1;                     /**< bit:      8  Cancellation Finished for Transmit Buffer 8   */
    uint32_t CF9:1;                     /**< bit:      9  Cancellation Finished for Transmit Buffer 9   */
    uint32_t CF10:1;                    /**< bit:     10  Cancellation Finished for Transmit Buffer 10  */
    uint32_t CF11:1;                    /**< bit:     11  Cancellation Finished for Transmit Buffer 11  */
    uint32_t CF12:1;                    /**< bit:     12  Cancellation Finished for Transmit Buffer 12  */
    uint32_t CF13:1;                    /**< bit:     13  Cancellation Finished for Transmit Buffer 13  */
    uint32_t CF14:1;                    /**< bit:     14  Cancellation Finished for Transmit Buffer 14  */
    uint32_t CF15:1;                    /**< bit:     15  Cancellation Finished for Transmit Buffer 15  */
    uint32_t CF16:1;                    /**< bit:     16  Cancellation Finished for Transmit Buffer 16  */
    uint32_t CF17:1;                    /**< bit:     17  Cancellation Finished for Transmit Buffer 17  */
    uint32_t CF18:1;                    /**< bit:     18  Cancellation Finished for Transmit Buffer 18  */
    uint32_t CF19:1;                    /**< bit:     19  Cancellation Finished for Transmit Buffer 19  */
    uint32_t CF20:1;                    /**< bit:     20  Cancellation Finished for Transmit Buffer 20  */
    uint32_t CF21:1;                    /**< bit:     21  Cancellation Finished for Transmit Buffer 21  */
    uint32_t CF22:1;                    /**< bit:     22  Cancellation Finished for Transmit Buffer 22  */
    uint32_t CF23:1;                    /**< bit:     23  Cancellation Finished for Transmit Buffer 23  */
    uint32_t CF24:1;                    /**< bit:     24  Cancellation Finished for Transmit Buffer 24  */
    uint32_t CF25:1;                    /**< bit:     25  Cancellation Finished for Transmit Buffer 25  */
    uint32_t CF26:1;                    /**< bit:     26  Cancellation Finished for Transmit Buffer 26  */
    uint32_t CF27:1;                    /**< bit:     27  Cancellation Finished for Transmit Buffer 27  */
    uint32_t CF28:1;                    /**< bit:     28  Cancellation Finished for Transmit Buffer 28  */
    uint32_t CF29:1;                    /**< bit:     29  Cancellation Finished for Transmit Buffer 29  */
    uint32_t CF30:1;                    /**< bit:     30  Cancellation Finished for Transmit Buffer 30  */
    uint32_t CF31:1;                    /**< bit:     31  Cancellation Finished for Transmit Buffer 31  */
  };
  struct
  {
    uint32_t CF:32;                     /**< bit:  0..31  Cancellation Finished for Transmit Buffer 3x  */
  };
  uint32_t w;
} __MCAN_TXBCF_bits_t;

