zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
#define MCAN_TXBCF_CF0_Pos                    (0)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 0 Position */
#define MCAN_TXBCF_CF0_Msk                    (0x1U << MCAN_TXBCF_CF0_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 0 Mask */
#define MCAN_TXBCF_CF1_Pos                    (1)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 1 Position */
#define MCAN_TXBCF_CF1_Msk                    (0x1U << MCAN_TXBCF_CF1_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 1 Mask */
#define MCAN_TXBCF_CF2_Pos                    (2)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 2 Position */
#define MCAN_TXBCF_CF2_Msk                    (0x1U << MCAN_TXBCF_CF2_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 2 Mask */
#define MCAN_TXBCF_CF3_Pos                    (3)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 3 Position */
#define MCAN_TXBCF_CF3_Msk                    (0x1U << MCAN_TXBCF_CF3_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 3 Mask */
#define MCAN_TXBCF_CF4_Pos                    (4)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 4 Position */
#define MCAN_TXBCF_CF4_Msk                    (0x1U << MCAN_TXBCF_CF4_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 4 Mask */
#define MCAN_TXBCF_CF5_Pos                    (5)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 5 Position */
#define MCAN_TXBCF_CF5_Msk                    (0x1U << MCAN_TXBCF_CF5_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 5 Mask */
#define MCAN_TXBCF_CF6_Pos                    (6)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 6 Position */
#define MCAN_TXBCF_CF6_Msk                    (0x1U << MCAN_TXBCF_CF6_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 6 Mask */
#define MCAN_TXBCF_CF7_Pos                    (7)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 7 Position */
#define MCAN_TXBCF_CF7_Msk                    (0x1U << MCAN_TXBCF_CF7_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 7 Mask */
#define MCAN_TXBCF_CF8_Pos                    (8)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 8 Position */
#define MCAN_TXBCF_CF8_Msk                    (0x1U << MCAN_TXBCF_CF8_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 8 Mask */
#define MCAN_TXBCF_CF9_Pos                    (9)                                            /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 9 Position */
#define MCAN_TXBCF_CF9_Msk                    (0x1U << MCAN_TXBCF_CF9_Pos)                   /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 9 Mask */
#define MCAN_TXBCF_CF10_Pos                   (10)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 10 Position */
#define MCAN_TXBCF_CF10_Msk                   (0x1U << MCAN_TXBCF_CF10_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 10 Mask */
#define MCAN_TXBCF_CF11_Pos                   (11)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 11 Position */
#define MCAN_TXBCF_CF11_Msk                   (0x1U << MCAN_TXBCF_CF11_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 11 Mask */
#define MCAN_TXBCF_CF12_Pos                   (12)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 12 Position */
#define MCAN_TXBCF_CF12_Msk                   (0x1U << MCAN_TXBCF_CF12_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 12 Mask */
#define MCAN_TXBCF_CF13_Pos                   (13)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 13 Position */
#define MCAN_TXBCF_CF13_Msk                   (0x1U << MCAN_TXBCF_CF13_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 13 Mask */
#define MCAN_TXBCF_CF14_Pos                   (14)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 14 Position */
#define MCAN_TXBCF_CF14_Msk                   (0x1U << MCAN_TXBCF_CF14_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 14 Mask */
#define MCAN_TXBCF_CF15_Pos                   (15)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 15 Position */
#define MCAN_TXBCF_CF15_Msk                   (0x1U << MCAN_TXBCF_CF15_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 15 Mask */
#define MCAN_TXBCF_CF16_Pos                   (16)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 16 Position */
#define MCAN_TXBCF_CF16_Msk                   (0x1U << MCAN_TXBCF_CF16_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 16 Mask */
#define MCAN_TXBCF_CF17_Pos                   (17)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 17 Position */
#define MCAN_TXBCF_CF17_Msk                   (0x1U << MCAN_TXBCF_CF17_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 17 Mask */
#define MCAN_TXBCF_CF18_Pos                   (18)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 18 Position */
#define MCAN_TXBCF_CF18_Msk                   (0x1U << MCAN_TXBCF_CF18_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 18 Mask */
#define MCAN_TXBCF_CF19_Pos                   (19)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 19 Position */
#define MCAN_TXBCF_CF19_Msk                   (0x1U << MCAN_TXBCF_CF19_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 19 Mask */
#define MCAN_TXBCF_CF20_Pos                   (20)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 20 Position */
#define MCAN_TXBCF_CF20_Msk                   (0x1U << MCAN_TXBCF_CF20_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 20 Mask */
#define MCAN_TXBCF_CF21_Pos                   (21)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 21 Position */
#define MCAN_TXBCF_CF21_Msk                   (0x1U << MCAN_TXBCF_CF21_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 21 Mask */
#define MCAN_TXBCF_CF22_Pos                   (22)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 22 Position */
#define MCAN_TXBCF_CF22_Msk                   (0x1U << MCAN_TXBCF_CF22_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 22 Mask */
#define MCAN_TXBCF_CF23_Pos                   (23)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 23 Position */
#define MCAN_TXBCF_CF23_Msk                   (0x1U << MCAN_TXBCF_CF23_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 23 Mask */
#define MCAN_TXBCF_CF24_Pos                   (24)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 24 Position */
#define MCAN_TXBCF_CF24_Msk                   (0x1U << MCAN_TXBCF_CF24_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 24 Mask */
#define MCAN_TXBCF_CF25_Pos                   (25)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 25 Position */
#define MCAN_TXBCF_CF25_Msk                   (0x1U << MCAN_TXBCF_CF25_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 25 Mask */
#define MCAN_TXBCF_CF26_Pos                   (26)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 26 Position */
#define MCAN_TXBCF_CF26_Msk                   (0x1U << MCAN_TXBCF_CF26_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 26 Mask */
#define MCAN_TXBCF_CF27_Pos                   (27)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 27 Position */
#define MCAN_TXBCF_CF27_Msk                   (0x1U << MCAN_TXBCF_CF27_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 27 Mask */
#define MCAN_TXBCF_CF28_Pos                   (28)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 28 Position */
#define MCAN_TXBCF_CF28_Msk                   (0x1U << MCAN_TXBCF_CF28_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 28 Mask */
#define MCAN_TXBCF_CF29_Pos                   (29)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 29 Position */
#define MCAN_TXBCF_CF29_Msk                   (0x1U << MCAN_TXBCF_CF29_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 29 Mask */
#define MCAN_TXBCF_CF30_Pos                   (30)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 30 Position */
#define MCAN_TXBCF_CF30_Msk                   (0x1U << MCAN_TXBCF_CF30_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 30 Mask */
#define MCAN_TXBCF_CF31_Pos                   (31)                                           /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 31 Position */
#define MCAN_TXBCF_CF31_Msk                   (0x1U << MCAN_TXBCF_CF31_Pos)                  /**< (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 31 Mask */
#define MCAN_TXBCF_Msk                        (0xFFFFFFFFUL)                                 /**< (MCAN_TXBCF) Register Mask  */
#define MCAN_TXBCF_CF_Pos                     (0)                                            /**< (MCAN_TXBCF Position) Cancellation Finished for Transmit Buffer 3x */
#define MCAN_TXBCF_CF_Msk                     (0xFFFFFFFFU << MCAN_TXBCF_CF_Pos)             /**< (MCAN_TXBCF Mask) CF */
#define MCAN_TXBCF_CF(value)                  (MCAN_TXBCF_CF_Msk & ((value) << MCAN_TXBCF_CF_Pos))

/* -------- MCAN_TXBTIE : (MCAN Offset: 0xe0) (R/W 32) Transmit Buffer Transmission Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TIE0:1;                    /**< bit:      0  Transmission Interrupt Enable for Buffer 0    */
    uint32_t TIE1:1;                    /**< bit:      1  Transmission Interrupt Enable for Buffer 1    */
    uint32_t TIE2:1;                    /**< bit:      2  Transmission Interrupt Enable for Buffer 2    */
    uint32_t TIE3:1;                    /**< bit:      3  Transmission Interrupt Enable for Buffer 3    */
    uint32_t TIE4:1;                    /**< bit:      4  Transmission Interrupt Enable for Buffer 4    */
    uint32_t TIE5:1;                    /**< bit:      5  Transmission Interrupt Enable for Buffer 5    */
    uint32_t TIE6:1;                    /**< bit:      6  Transmission Interrupt Enable for Buffer 6    */
    uint32_t TIE7:1;                    /**< bit:      7  Transmission Interrupt Enable for Buffer 7    */
    uint32_t TIE8:1;                    /**< bit:      8  Transmission Interrupt Enable for Buffer 8    */
    uint32_t TIE9:1;                    /**< bit:      9  Transmission Interrupt Enable for Buffer 9    */
    uint32_t TIE10:1;                   /**< bit:     10  Transmission Interrupt Enable for Buffer 10   */
    uint32_t TIE11:1;                   /**< bit:     11  Transmission Interrupt Enable for Buffer 11   */
    uint32_t TIE12:1;                   /**< bit:     12  Transmission Interrupt Enable for Buffer 12   */
    uint32_t TIE13:1;                   /**< bit:     13  Transmission Interrupt Enable for Buffer 13   */
    uint32_t TIE14:1;                   /**< bit:     14  Transmission Interrupt Enable for Buffer 14   */
    uint32_t TIE15:1;                   /**< bit:     15  Transmission Interrupt Enable for Buffer 15   */
    uint32_t TIE16:1;                   /**< bit:     16  Transmission Interrupt Enable for Buffer 16   */
    uint32_t TIE17:1;                   /**< bit:     17  Transmission Interrupt Enable for Buffer 17   */
    uint32_t TIE18:1;                   /**< bit:     18  Transmission Interrupt Enable for Buffer 18   */
    uint32_t TIE19:1;                   /**< bit:     19  Transmission Interrupt Enable for Buffer 19   */
    uint32_t TIE20:1;                   /**< bit:     20  Transmission Interrupt Enable for Buffer 20   */
    uint32_t TIE21:1;                   /**< bit:     21  Transmission Interrupt Enable for Buffer 21   */
    uint32_t TIE22:1;                   /**< bit:     22  Transmission Interrupt Enable for Buffer 22   */
    uint32_t TIE23:1;                   /**< bit:     23  Transmission Interrupt Enable for Buffer 23   */
    uint32_t TIE24:1;                   /**< bit:     24  Transmission Interrupt Enable for Buffer 24   */
    uint32_t TIE25:1;                   /**< bit:     25  Transmission Interrupt Enable for Buffer 25   */
    uint32_t TIE26:1;                   /**< bit:     26  Transmission Interrupt Enable for Buffer 26   */
    uint32_t TIE27:1;                   /**< bit:     27  Transmission Interrupt Enable for Buffer 27   */
    uint32_t TIE28:1;                   /**< bit:     28  Transmission Interrupt Enable for Buffer 28   */
    uint32_t TIE29:1;                   /**< bit:     29  Transmission Interrupt Enable for Buffer 29   */
    uint32_t TIE30:1;                   /**< bit:     30  Transmission Interrupt Enable for Buffer 30   */
    uint32_t TIE31:1;                   /**< bit:     31  Transmission Interrupt Enable for Buffer 31   */
  };
  struct
  {
    uint32_t TIE:32;                    /**< bit:  0..31  Transmission Interrupt Enable for Buffer 3x   */
  };
  uint32_t w;
} __MCAN_TXBTIE_bits_t;

