zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
#define MCAN_TXBCIE_CFIE0_Pos                 (0)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 0 Position */
#define MCAN_TXBCIE_CFIE0_Msk                 (0x1U << MCAN_TXBCIE_CFIE0_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 0 Mask */
#define MCAN_TXBCIE_CFIE1_Pos                 (1)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 1 Position */
#define MCAN_TXBCIE_CFIE1_Msk                 (0x1U << MCAN_TXBCIE_CFIE1_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 1 Mask */
#define MCAN_TXBCIE_CFIE2_Pos                 (2)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 2 Position */
#define MCAN_TXBCIE_CFIE2_Msk                 (0x1U << MCAN_TXBCIE_CFIE2_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 2 Mask */
#define MCAN_TXBCIE_CFIE3_Pos                 (3)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 3 Position */
#define MCAN_TXBCIE_CFIE3_Msk                 (0x1U << MCAN_TXBCIE_CFIE3_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 3 Mask */
#define MCAN_TXBCIE_CFIE4_Pos                 (4)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 4 Position */
#define MCAN_TXBCIE_CFIE4_Msk                 (0x1U << MCAN_TXBCIE_CFIE4_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 4 Mask */
#define MCAN_TXBCIE_CFIE5_Pos                 (5)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 5 Position */
#define MCAN_TXBCIE_CFIE5_Msk                 (0x1U << MCAN_TXBCIE_CFIE5_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 5 Mask */
#define MCAN_TXBCIE_CFIE6_Pos                 (6)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 6 Position */
#define MCAN_TXBCIE_CFIE6_Msk                 (0x1U << MCAN_TXBCIE_CFIE6_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 6 Mask */
#define MCAN_TXBCIE_CFIE7_Pos                 (7)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 7 Position */
#define MCAN_TXBCIE_CFIE7_Msk                 (0x1U << MCAN_TXBCIE_CFIE7_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 7 Mask */
#define MCAN_TXBCIE_CFIE8_Pos                 (8)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 8 Position */
#define MCAN_TXBCIE_CFIE8_Msk                 (0x1U << MCAN_TXBCIE_CFIE8_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 8 Mask */
#define MCAN_TXBCIE_CFIE9_Pos                 (9)                                            /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 9 Position */
#define MCAN_TXBCIE_CFIE9_Msk                 (0x1U << MCAN_TXBCIE_CFIE9_Pos)                /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 9 Mask */
#define MCAN_TXBCIE_CFIE10_Pos                (10)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 10 Position */
#define MCAN_TXBCIE_CFIE10_Msk                (0x1U << MCAN_TXBCIE_CFIE10_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 10 Mask */
#define MCAN_TXBCIE_CFIE11_Pos                (11)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 11 Position */
#define MCAN_TXBCIE_CFIE11_Msk                (0x1U << MCAN_TXBCIE_CFIE11_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 11 Mask */
#define MCAN_TXBCIE_CFIE12_Pos                (12)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 12 Position */
#define MCAN_TXBCIE_CFIE12_Msk                (0x1U << MCAN_TXBCIE_CFIE12_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 12 Mask */
#define MCAN_TXBCIE_CFIE13_Pos                (13)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 13 Position */
#define MCAN_TXBCIE_CFIE13_Msk                (0x1U << MCAN_TXBCIE_CFIE13_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 13 Mask */
#define MCAN_TXBCIE_CFIE14_Pos                (14)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 14 Position */
#define MCAN_TXBCIE_CFIE14_Msk                (0x1U << MCAN_TXBCIE_CFIE14_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 14 Mask */
#define MCAN_TXBCIE_CFIE15_Pos                (15)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 15 Position */
#define MCAN_TXBCIE_CFIE15_Msk                (0x1U << MCAN_TXBCIE_CFIE15_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 15 Mask */
#define MCAN_TXBCIE_CFIE16_Pos                (16)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 16 Position */
#define MCAN_TXBCIE_CFIE16_Msk                (0x1U << MCAN_TXBCIE_CFIE16_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 16 Mask */
#define MCAN_TXBCIE_CFIE17_Pos                (17)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 17 Position */
#define MCAN_TXBCIE_CFIE17_Msk                (0x1U << MCAN_TXBCIE_CFIE17_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 17 Mask */
#define MCAN_TXBCIE_CFIE18_Pos                (18)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 18 Position */
#define MCAN_TXBCIE_CFIE18_Msk                (0x1U << MCAN_TXBCIE_CFIE18_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 18 Mask */
#define MCAN_TXBCIE_CFIE19_Pos                (19)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 19 Position */
#define MCAN_TXBCIE_CFIE19_Msk                (0x1U << MCAN_TXBCIE_CFIE19_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 19 Mask */
#define MCAN_TXBCIE_CFIE20_Pos                (20)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 20 Position */
#define MCAN_TXBCIE_CFIE20_Msk                (0x1U << MCAN_TXBCIE_CFIE20_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 20 Mask */
#define MCAN_TXBCIE_CFIE21_Pos                (21)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 21 Position */
#define MCAN_TXBCIE_CFIE21_Msk                (0x1U << MCAN_TXBCIE_CFIE21_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 21 Mask */
#define MCAN_TXBCIE_CFIE22_Pos                (22)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 22 Position */
#define MCAN_TXBCIE_CFIE22_Msk                (0x1U << MCAN_TXBCIE_CFIE22_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 22 Mask */
#define MCAN_TXBCIE_CFIE23_Pos                (23)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 23 Position */
#define MCAN_TXBCIE_CFIE23_Msk                (0x1U << MCAN_TXBCIE_CFIE23_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 23 Mask */
#define MCAN_TXBCIE_CFIE24_Pos                (24)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 24 Position */
#define MCAN_TXBCIE_CFIE24_Msk                (0x1U << MCAN_TXBCIE_CFIE24_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 24 Mask */
#define MCAN_TXBCIE_CFIE25_Pos                (25)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 25 Position */
#define MCAN_TXBCIE_CFIE25_Msk                (0x1U << MCAN_TXBCIE_CFIE25_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 25 Mask */
#define MCAN_TXBCIE_CFIE26_Pos                (26)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 26 Position */
#define MCAN_TXBCIE_CFIE26_Msk                (0x1U << MCAN_TXBCIE_CFIE26_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 26 Mask */
#define MCAN_TXBCIE_CFIE27_Pos                (27)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 27 Position */
#define MCAN_TXBCIE_CFIE27_Msk                (0x1U << MCAN_TXBCIE_CFIE27_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 27 Mask */
#define MCAN_TXBCIE_CFIE28_Pos                (28)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 28 Position */
#define MCAN_TXBCIE_CFIE28_Msk                (0x1U << MCAN_TXBCIE_CFIE28_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 28 Mask */
#define MCAN_TXBCIE_CFIE29_Pos                (29)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 29 Position */
#define MCAN_TXBCIE_CFIE29_Msk                (0x1U << MCAN_TXBCIE_CFIE29_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 29 Mask */
#define MCAN_TXBCIE_CFIE30_Pos                (30)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 30 Position */
#define MCAN_TXBCIE_CFIE30_Msk                (0x1U << MCAN_TXBCIE_CFIE30_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 30 Mask */
#define MCAN_TXBCIE_CFIE31_Pos                (31)                                           /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 31 Position */
#define MCAN_TXBCIE_CFIE31_Msk                (0x1U << MCAN_TXBCIE_CFIE31_Pos)               /**< (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 31 Mask */
#define MCAN_TXBCIE_Msk                       (0xFFFFFFFFUL)                                 /**< (MCAN_TXBCIE) Register Mask  */
#define MCAN_TXBCIE_CFIE_Pos                  (0)                                            /**< (MCAN_TXBCIE Position) Cancellation Finished Interrupt Enable for Transmit Buffer 3x */
#define MCAN_TXBCIE_CFIE_Msk                  (0xFFFFFFFFU << MCAN_TXBCIE_CFIE_Pos)          /**< (MCAN_TXBCIE Mask) CFIE */
#define MCAN_TXBCIE_CFIE(value)               (MCAN_TXBCIE_CFIE_Msk & ((value) << MCAN_TXBCIE_CFIE_Pos))

/* -------- MCAN_TXEFC : (MCAN Offset: 0xf0) (R/W 32) Transmit Event FIFO Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t EFSA:14;                   /**< bit:  2..15  Event FIFO Start Address                      */
    uint32_t EFS:6;                     /**< bit: 16..21  Event FIFO Size                               */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t EFWM:6;                    /**< bit: 24..29  Event FIFO Watermark                          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_TXEFC_bits_t;

#define MCAN_TXEFC_EFSA_Pos                   (2)                                            /**< (MCAN_TXEFC) Event FIFO Start Address Position */
#define MCAN_TXEFC_EFSA_Msk                   (0x3FFFU << MCAN_TXEFC_EFSA_Pos)               /**< (MCAN_TXEFC) Event FIFO Start Address Mask */
#define MCAN_TXEFC_EFSA(value)                (MCAN_TXEFC_EFSA_Msk & ((value) << MCAN_TXEFC_EFSA_Pos))
#define MCAN_TXEFC_EFS_Pos                    (16)                                           /**< (MCAN_TXEFC) Event FIFO Size Position */
#define MCAN_TXEFC_EFS_Msk                    (0x3FU << MCAN_TXEFC_EFS_Pos)                  /**< (MCAN_TXEFC) Event FIFO Size Mask */
#define MCAN_TXEFC_EFS(value)                 (MCAN_TXEFC_EFS_Msk & ((value) << MCAN_TXEFC_EFS_Pos))
#define MCAN_TXEFC_EFWM_Pos                   (24)                                           /**< (MCAN_TXEFC) Event FIFO Watermark Position */
#define MCAN_TXEFC_EFWM_Msk                   (0x3FU << MCAN_TXEFC_EFWM_Pos)                 /**< (MCAN_TXEFC) Event FIFO Watermark Mask */
#define MCAN_TXEFC_EFWM(value)                (MCAN_TXEFC_EFWM_Msk & ((value) << MCAN_TXEFC_EFWM_Pos))
#define MCAN_TXEFC_Msk                        (0x3F3FFFFCUL)                                 /**< (MCAN_TXEFC) Register Mask  */

/* -------- MCAN_TXEFS : (MCAN Offset: 0xf4) (R/ 32) Transmit Event FIFO Status Register -------- */

typedef union
{
  struct
  {
    uint32_t EFFL:6;                    /**< bit:   0..5  Event FIFO Fill Level                         */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t EFGI:5;                    /**< bit:  8..12  Event FIFO Get Index                          */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t EFPI:5;                    /**< bit: 16..20  Event FIFO Put Index                          */
    uint32_t :3;                        /**< bit: 21..23  Reserved                                      */
    uint32_t EFF:1;                     /**< bit:     24  Event FIFO Full                               */
    uint32_t TEFL:1;                    /**< bit:     25  Tx Event FIFO Element Lost                    */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_TXEFS_bits_t;

#define MCAN_TXEFS_EFFL_Pos                   (0)                                            /**< (MCAN_TXEFS) Event FIFO Fill Level Position */
#define MCAN_TXEFS_EFFL_Msk                   (0x3FU << MCAN_TXEFS_EFFL_Pos)                 /**< (MCAN_TXEFS) Event FIFO Fill Level Mask */
#define MCAN_TXEFS_EFFL(value)                (MCAN_TXEFS_EFFL_Msk & ((value) << MCAN_TXEFS_EFFL_Pos))
#define MCAN_TXEFS_EFGI_Pos                   (8)                                            /**< (MCAN_TXEFS) Event FIFO Get Index Position */
#define MCAN_TXEFS_EFGI_Msk                   (0x1FU << MCAN_TXEFS_EFGI_Pos)                 /**< (MCAN_TXEFS) Event FIFO Get Index Mask */
#define MCAN_TXEFS_EFGI(value)                (MCAN_TXEFS_EFGI_Msk & ((value) << MCAN_TXEFS_EFGI_Pos))
#define MCAN_TXEFS_EFPI_Pos                   (16)                                           /**< (MCAN_TXEFS) Event FIFO Put Index Position */
#define MCAN_TXEFS_EFPI_Msk                   (0x1FU << MCAN_TXEFS_EFPI_Pos)                 /**< (MCAN_TXEFS) Event FIFO Put Index Mask */
#define MCAN_TXEFS_EFPI(value)                (MCAN_TXEFS_EFPI_Msk & ((value) << MCAN_TXEFS_EFPI_Pos))
#define MCAN_TXEFS_EFF_Pos                    (24)                                           /**< (MCAN_TXEFS) Event FIFO Full Position */
#define MCAN_TXEFS_EFF_Msk                    (0x1U << MCAN_TXEFS_EFF_Pos)                   /**< (MCAN_TXEFS) Event FIFO Full Mask */
#define MCAN_TXEFS_TEFL_Pos                   (25)                                           /**< (MCAN_TXEFS) Tx Event FIFO Element Lost Position */
#define MCAN_TXEFS_TEFL_Msk                   (0x1U << MCAN_TXEFS_TEFL_Pos)                  /**< (MCAN_TXEFS) Tx Event FIFO Element Lost Mask */
#define MCAN_TXEFS_Msk                        (0x031F1F3FUL)                                 /**< (MCAN_TXEFS) Register Mask  */

/* -------- MCAN_TXEFA : (MCAN Offset: 0xf8) (R/W 32) Transmit Event FIFO Acknowledge Register -------- */

typedef union
{
  struct
  {
    uint32_t EFAI:5;                    /**< bit:   0..4  Event FIFO Acknowledge Index                  */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __MCAN_TXEFA_bits_t;

#define MCAN_TXEFA_EFAI_Pos                   (0)                                            /**< (MCAN_TXEFA) Event FIFO Acknowledge Index Position */
#define MCAN_TXEFA_EFAI_Msk                   (0x1FU << MCAN_TXEFA_EFAI_Pos)                 /**< (MCAN_TXEFA) Event FIFO Acknowledge Index Mask */
#define MCAN_TXEFA_EFAI(value)                (MCAN_TXEFA_EFAI_Msk & ((value) << MCAN_TXEFA_EFAI_Pos))
#define MCAN_TXEFA_Msk                        (0x0000001FUL)                                 /**< (MCAN_TXEFA) Register Mask  */

/** \brief MCAN register offsets definitions */
#define MCAN_CREL_OFFSET             (0x00)         /**< (MCAN_CREL) Core Release Register Offset */
#define MCAN_ENDN_OFFSET             (0x04)         /**< (MCAN_ENDN) Endian Register Offset */
#define MCAN_CUST_OFFSET             (0x08)         /**< (MCAN_CUST) Customer Register Offset */
#define MCAN_DBTP_OFFSET             (0x0C)         /**< (MCAN_DBTP) Data Bit Timing and Prescaler Register Offset */
#define MCAN_TEST_OFFSET             (0x10)         /**< (MCAN_TEST) Test Register Offset */
#define MCAN_RWD_OFFSET              (0x14)         /**< (MCAN_RWD) RAM Watchdog Register Offset */
#define MCAN_CCCR_OFFSET             (0x18)         /**< (MCAN_CCCR) CC Control Register Offset */
#define MCAN_NBTP_OFFSET             (0x1C)         /**< (MCAN_NBTP) Nominal Bit Timing and Prescaler Register Offset */
#define MCAN_TSCC_OFFSET             (0x20)         /**< (MCAN_TSCC) Timestamp Counter Configuration Register Offset */
#define MCAN_TSCV_OFFSET             (0x24)         /**< (MCAN_TSCV) Timestamp Counter Value Register Offset */
#define MCAN_TOCC_OFFSET             (0x28)         /**< (MCAN_TOCC) Timeout Counter Configuration Register Offset */
#define MCAN_TOCV_OFFSET             (0x2C)         /**< (MCAN_TOCV) Timeout Counter Value Register Offset */
#define MCAN_ECR_OFFSET              (0x40)         /**< (MCAN_ECR) Error Counter Register Offset */
#define MCAN_PSR_OFFSET              (0x44)         /**< (MCAN_PSR) Protocol Status Register Offset */
#define MCAN_TDCR_OFFSET             (0x48)         /**< (MCAN_TDCR) Transmit Delay Compensation Register Offset */
#define MCAN_IR_OFFSET               (0x50)         /**< (MCAN_IR) Interrupt Register Offset */
#define MCAN_IE_OFFSET               (0x54)         /**< (MCAN_IE) Interrupt Enable Register Offset */
#define MCAN_ILS_OFFSET              (0x58)         /**< (MCAN_ILS) Interrupt Line Select Register Offset */
#define MCAN_ILE_OFFSET              (0x5C)         /**< (MCAN_ILE) Interrupt Line Enable Register Offset */
#define MCAN_GFC_OFFSET              (0x80)         /**< (MCAN_GFC) Global Filter Configuration Register Offset */
#define MCAN_SIDFC_OFFSET            (0x84)         /**< (MCAN_SIDFC) Standard ID Filter Configuration Register Offset */
#define MCAN_XIDFC_OFFSET            (0x88)         /**< (MCAN_XIDFC) Extended ID Filter Configuration Register Offset */
#define MCAN_XIDAM_OFFSET            (0x90)         /**< (MCAN_XIDAM) Extended ID AND Mask Register Offset */
#define MCAN_HPMS_OFFSET             (0x94)         /**< (MCAN_HPMS) High Priority Message Status Register Offset */
#define MCAN_NDAT1_OFFSET            (0x98)         /**< (MCAN_NDAT1) New Data 1 Register Offset */
#define MCAN_NDAT2_OFFSET            (0x9C)         /**< (MCAN_NDAT2) New Data 2 Register Offset */
#define MCAN_RXF0C_OFFSET            (0xA0)         /**< (MCAN_RXF0C) Receive FIFO 0 Configuration Register Offset */
#define MCAN_RXF0S_OFFSET            (0xA4)         /**< (MCAN_RXF0S) Receive FIFO 0 Status Register Offset */
#define MCAN_RXF0A_OFFSET            (0xA8)         /**< (MCAN_RXF0A) Receive FIFO 0 Acknowledge Register Offset */
#define MCAN_RXBC_OFFSET             (0xAC)         /**< (MCAN_RXBC) Receive Rx Buffer Configuration Register Offset */
#define MCAN_RXF1C_OFFSET            (0xB0)         /**< (MCAN_RXF1C) Receive FIFO 1 Configuration Register Offset */
#define MCAN_RXF1S_OFFSET            (0xB4)         /**< (MCAN_RXF1S) Receive FIFO 1 Status Register Offset */
#define MCAN_RXF1A_OFFSET            (0xB8)         /**< (MCAN_RXF1A) Receive FIFO 1 Acknowledge Register Offset */
#define MCAN_RXESC_OFFSET            (0xBC)         /**< (MCAN_RXESC) Receive Buffer / FIFO Element Size Configuration Register Offset */
#define MCAN_TXBC_OFFSET             (0xC0)         /**< (MCAN_TXBC) Transmit Buffer Configuration Register Offset */
#define MCAN_TXFQS_OFFSET            (0xC4)         /**< (MCAN_TXFQS) Transmit FIFO/Queue Status Register Offset */
#define MCAN_TXESC_OFFSET            (0xC8)         /**< (MCAN_TXESC) Transmit Buffer Element Size Configuration Register Offset */
#define MCAN_TXBRP_OFFSET            (0xCC)         /**< (MCAN_TXBRP) Transmit Buffer Request Pending Register Offset */
#define MCAN_TXBAR_OFFSET            (0xD0)         /**< (MCAN_TXBAR) Transmit Buffer Add Request Register Offset */
#define MCAN_TXBCR_OFFSET            (0xD4)         /**< (MCAN_TXBCR) Transmit Buffer Cancellation Request Register Offset */
#define MCAN_TXBTO_OFFSET            (0xD8)         /**< (MCAN_TXBTO) Transmit Buffer Transmission Occurred Register Offset */
#define MCAN_TXBCF_OFFSET            (0xDC)         /**< (MCAN_TXBCF) Transmit Buffer Cancellation Finished Register Offset */
#define MCAN_TXBTIE_OFFSET           (0xE0)         /**< (MCAN_TXBTIE) Transmit Buffer Transmission Interrupt Enable Register Offset */
#define MCAN_TXBCIE_OFFSET           (0xE4)         /**< (MCAN_TXBCIE) Transmit Buffer Cancellation Finished Interrupt Enable Register Offset */
#define MCAN_TXEFC_OFFSET            (0xF0)         /**< (MCAN_TXEFC) Transmit Event FIFO Configuration Register Offset */
#define MCAN_TXEFS_OFFSET            (0xF4)         /**< (MCAN_TXEFS) Transmit Event FIFO Status Register Offset */
#define MCAN_TXEFA_OFFSET            (0xF8)         /**< (MCAN_TXEFA) Transmit Event FIFO Acknowledge Register Offset */

