zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mcan.h
/** \brief MCAN register API structure */
typedef struct
{
  __I   __MCAN_CREL_bits_t             MCAN_CREL;     /**< Offset: 0x00 (R/   32) Core Release Register */
  __I   __MCAN_ENDN_bits_t             MCAN_ENDN;     /**< Offset: 0x04 (R/   32) Endian Register */
  __IO  __MCAN_CUST_bits_t             MCAN_CUST;     /**< Offset: 0x08 (R/W  32) Customer Register */
  __IO  __MCAN_DBTP_bits_t             MCAN_DBTP;     /**< Offset: 0x0C (R/W  32) Data Bit Timing and Prescaler Register */
  __IO  __MCAN_TEST_bits_t             MCAN_TEST;     /**< Offset: 0x10 (R/W  32) Test Register */
  __IO  __MCAN_RWD_bits_t              MCAN_RWD;      /**< Offset: 0x14 (R/W  32) RAM Watchdog Register */
  __IO  __MCAN_CCCR_bits_t             MCAN_CCCR;     /**< Offset: 0x18 (R/W  32) CC Control Register */
  __IO  __MCAN_NBTP_bits_t             MCAN_NBTP;     /**< Offset: 0x1C (R/W  32) Nominal Bit Timing and Prescaler Register */
  __IO  __MCAN_TSCC_bits_t             MCAN_TSCC;     /**< Offset: 0x20 (R/W  32) Timestamp Counter Configuration Register */
  __IO  __MCAN_TSCV_bits_t             MCAN_TSCV;     /**< Offset: 0x24 (R/W  32) Timestamp Counter Value Register */
  __IO  __MCAN_TOCC_bits_t             MCAN_TOCC;     /**< Offset: 0x28 (R/W  32) Timeout Counter Configuration Register */
  __IO  __MCAN_TOCV_bits_t             MCAN_TOCV;     /**< Offset: 0x2C (R/W  32) Timeout Counter Value Register */
  __I   uint8_t                        Reserved1[0x10];
  __I   __MCAN_ECR_bits_t              MCAN_ECR;      /**< Offset: 0x40 (R/   32) Error Counter Register */
  __I   __MCAN_PSR_bits_t              MCAN_PSR;      /**< Offset: 0x44 (R/   32) Protocol Status Register */
  __IO  __MCAN_TDCR_bits_t             MCAN_TDCR;     /**< Offset: 0x48 (R/W  32) Transmit Delay Compensation Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  __MCAN_IR_bits_t               MCAN_IR;       /**< Offset: 0x50 (R/W  32) Interrupt Register */
  __IO  __MCAN_IE_bits_t               MCAN_IE;       /**< Offset: 0x54 (R/W  32) Interrupt Enable Register */
  __IO  __MCAN_ILS_bits_t              MCAN_ILS;      /**< Offset: 0x58 (R/W  32) Interrupt Line Select Register */
  __IO  __MCAN_ILE_bits_t              MCAN_ILE;      /**< Offset: 0x5C (R/W  32) Interrupt Line Enable Register */
  __I   uint8_t                        Reserved3[0x20];
  __IO  __MCAN_GFC_bits_t              MCAN_GFC;      /**< Offset: 0x80 (R/W  32) Global Filter Configuration Register */
  __IO  __MCAN_SIDFC_bits_t            MCAN_SIDFC;    /**< Offset: 0x84 (R/W  32) Standard ID Filter Configuration Register */
  __IO  __MCAN_XIDFC_bits_t            MCAN_XIDFC;    /**< Offset: 0x88 (R/W  32) Extended ID Filter Configuration Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  __MCAN_XIDAM_bits_t            MCAN_XIDAM;    /**< Offset: 0x90 (R/W  32) Extended ID AND Mask Register */
  __I   __MCAN_HPMS_bits_t             MCAN_HPMS;     /**< Offset: 0x94 (R/   32) High Priority Message Status Register */
  __IO  __MCAN_NDAT1_bits_t            MCAN_NDAT1;    /**< Offset: 0x98 (R/W  32) New Data 1 Register */
  __IO  __MCAN_NDAT2_bits_t            MCAN_NDAT2;    /**< Offset: 0x9C (R/W  32) New Data 2 Register */
  __IO  __MCAN_RXF0C_bits_t            MCAN_RXF0C;    /**< Offset: 0xA0 (R/W  32) Receive FIFO 0 Configuration Register */
  __I   __MCAN_RXF0S_bits_t            MCAN_RXF0S;    /**< Offset: 0xA4 (R/   32) Receive FIFO 0 Status Register */
  __IO  __MCAN_RXF0A_bits_t            MCAN_RXF0A;    /**< Offset: 0xA8 (R/W  32) Receive FIFO 0 Acknowledge Register */
  __IO  __MCAN_RXBC_bits_t             MCAN_RXBC;     /**< Offset: 0xAC (R/W  32) Receive Rx Buffer Configuration Register */
  __IO  __MCAN_RXF1C_bits_t            MCAN_RXF1C;    /**< Offset: 0xB0 (R/W  32) Receive FIFO 1 Configuration Register */
  __I   __MCAN_RXF1S_bits_t            MCAN_RXF1S;    /**< Offset: 0xB4 (R/   32) Receive FIFO 1 Status Register */
  __IO  __MCAN_RXF1A_bits_t            MCAN_RXF1A;    /**< Offset: 0xB8 (R/W  32) Receive FIFO 1 Acknowledge Register */
  __IO  __MCAN_RXESC_bits_t            MCAN_RXESC;    /**< Offset: 0xBC (R/W  32) Receive Buffer / FIFO Element Size Configuration Register */
  __IO  __MCAN_TXBC_bits_t             MCAN_TXBC;     /**< Offset: 0xC0 (R/W  32) Transmit Buffer Configuration Register */
  __I   __MCAN_TXFQS_bits_t            MCAN_TXFQS;    /**< Offset: 0xC4 (R/   32) Transmit FIFO/Queue Status Register */
  __IO  __MCAN_TXESC_bits_t            MCAN_TXESC;    /**< Offset: 0xC8 (R/W  32) Transmit Buffer Element Size Configuration Register */
  __I   __MCAN_TXBRP_bits_t            MCAN_TXBRP;    /**< Offset: 0xCC (R/   32) Transmit Buffer Request Pending Register */
  __IO  __MCAN_TXBAR_bits_t            MCAN_TXBAR;    /**< Offset: 0xD0 (R/W  32) Transmit Buffer Add Request Register */
  __IO  __MCAN_TXBCR_bits_t            MCAN_TXBCR;    /**< Offset: 0xD4 (R/W  32) Transmit Buffer Cancellation Request Register */
  __I   __MCAN_TXBTO_bits_t            MCAN_TXBTO;    /**< Offset: 0xD8 (R/   32) Transmit Buffer Transmission Occurred Register */
  __I   __MCAN_TXBCF_bits_t            MCAN_TXBCF;    /**< Offset: 0xDC (R/   32) Transmit Buffer Cancellation Finished Register */
  __IO  __MCAN_TXBTIE_bits_t           MCAN_TXBTIE;   /**< Offset: 0xE0 (R/W  32) Transmit Buffer Transmission Interrupt Enable Register */
  __IO  __MCAN_TXBCIE_bits_t           MCAN_TXBCIE;   /**< Offset: 0xE4 (R/W  32) Transmit Buffer Cancellation Finished Interrupt Enable Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  __MCAN_TXEFC_bits_t            MCAN_TXEFC;    /**< Offset: 0xF0 (R/W  32) Transmit Event FIFO Configuration Register */
  __I   __MCAN_TXEFS_bits_t            MCAN_TXEFS;    /**< Offset: 0xF4 (R/   32) Transmit Event FIFO Status Register */
  __IO  __MCAN_TXEFA_bits_t            MCAN_TXEFA;    /**< Offset: 0xF8 (R/W  32) Transmit Event FIFO Acknowledge Register */
} mcan_registers_t;
/** @}  end of Controller Area Network */

#endif /* _PIC32CZ_CA70_MCAN_COMPONENT_H_ */
